[{"label": "CRIME", "text": "She left her husband. He killed their children. Just another day in America."}, {"label": "ENTERTAINMENT", "text": "Of course it has a song."}, {"label": "ENTERTAINMENT", "text": "The actor and his longtime girlfriend Anna Eberstein tied the knot in a civil ceremony."}, {"label": "ENTERTAINMENT", "text": "The actor gives Dems an ass-kicking for not fighting hard enough against Donald Trump."}, {"label": "ENTERTAINMENT", "text": "The \"Dietland\" actress said using the bags is a \"really cathartic, therapeutic moment.\""}, {"label": "ENTERTAINMENT", "text": "\"It is not right to equate horrific incidents of sexual assault with misplaced compliments or humor,\" he said in a statement."}, {"label": "ENTERTAINMENT", "text": "It's catchy, all right."}, {"label": "ENTERTAINMENT", "text": "There's a great mini-series joining this week."}, {"label": "ENTERTAINMENT", "text": "Myer's kids may be pushing for a new \"Powers\" film more than anyone."}, {"label": "ENTERTAINMENT", "text": "You're getting a recent Academy Award-winning movie."}, {"label": "ENTERTAINMENT", "text": "The pop star also wore a \"Santa Fe Strong\" shirt at his show in Houston."}, {"label": "WORLD NEWS", "text": "The two met to pave the way for a summit between North Korean and the U.S."}, {"label": "IMPACT", "text": "The revolution is coming to rural New Brunswick."}, {"label": "POLITICS", "text": "Last month a Health and Human Services official revealed the government was unable to locate nearly 1,500 children who had been released from its custody."}, {"label": "POLITICS", "text": "The wiretaps feature conversations between Alexander Torshin and Alexander Romanov, a convicted Russian money launderer."}, {"label": "POLITICS", "text": "But don't count on Robert Mueller to nail him, the NSA whistleblower warns."}, {"label": "POLITICS", "text": "Just a peeping minute."}, {"label": "POLITICS", "text": "Irish women will no longer have to travel to the United Kingdom to end their pregnancies."}, {"label": "POLITICS", "text": "The interior secretary attempts damage control with hunting and fishing groups that didn’t like his fossil fuel focus."}, {"label": "POLITICS", "text": "And there are four times as many male as female executives."}, {"label": "WEIRD NEWS", "text": "Why buy a boring tie when you can give him testicle plush toys?"}, {"label": "ENTERTAINMENT", "text": "There's no such thing as too much \"Star Wars.\""}, {"label": "WEIRD NEWS", "text": "“We have no idea what this was until we get a DNA report back.\""}, {"label": "WORLD NEWS", "text": "Trump’s announcement came after repeated threats by North Korea to pull out of the summit over what it saw as confrontational remarks by U.S. officials."}, {"label": "WORLD NEWS", "text": "Fifteen people were taken to the hospital, three of them with critical injuries."}, {"label": "WORLD NEWS", "text": "Just try to read these #HomeToVote tweets without crying."}, {"label": "WORLD NEWS", "text": "Vote counting will begin Saturday."}, {"label": "BLACK VOICES", "text": "Forbidding players to take a knee during the national anthem is “idiotic,” the coach said."}, {"label": "BLACK VOICES", "text": "Mia Amor Mottley even earned the backing of the country's most recognizable national: Rihanna."}, {"label": "BLACK VOICES", "text": "These Americans deserve to be more than another statistic."}, {"label": "POLITICS", "text": "A new law to fight sex trafficking targets some of the people it ostensibly aims to protect."}, {"label": "BLACK VOICES", "text": "Lee brought more original shows to the black entertainment network and focused on family programming."}, {"label": "CRIME", "text": "State prosecutors say almost $84,000 had been deposited into her bank account while she was receiving public assistance."}, {"label": "POLITICS", "text": "For Curry and others, being Christian means rejecting white nationalism and misogyny, while protecting immigrants, refugees and the poor."}, {"label": "ENTERTAINMENT", "text": "Pusha T's album, produced by West, features a photo of the late singer's bathroom."}, {"label": "WOMEN", "text": "Both Visa and Vancouver's public transit system have suspended work with him."}, {"label": "POLITICS", "text": "The Chinese Exclusion Act barely gets mentioned in U.S. history classes. A new PBS documentary from directors Ric Burns and Li-Shin Yu could change that."}, {"label": "COMEDY", "text": "\"Does this swimsuit make me look racist?\""}, {"label": "COMEDY", "text": "There goes the one token of his appreciation."}, {"label": "COMEDY", "text": "The \"Late Show\" host takes on Michael Cohen and his \"taxi king\" business partner."}, {"label": "CRIME", "text": "“We thought we were going to die,\" one of the students said."}, {"label": "COMEDY", "text": "The host reimagined the cartoon after Ayatollah Ali Khamenei brought up the cat and mouse in defiance of U.S. threats."}, {"label": "CRIME", "text": "A male student, believed to be the suspect, has been detained, according to police."}, {"label": "ENTERTAINMENT", "text": "Suleiman Abdulfatai looks like he could be the actor's long-lost brother."}, {"label": "ENTERTAINMENT", "text": "The comedian suggested Jessica Walter was also abusive on set after saying he’d apologize for defending Jeffrey Tambor."}, {"label": "ENTERTAINMENT", "text": "“The Happytime Murders” refers to the classic show in its tagline."}, {"label": "ENTERTAINMENT", "text": "Directors Joe and Anthony Russo answer our most pressing questions."}, {"label": "ENTERTAINMENT", "text": "The \"Star Trek\" actor was accused of groping a model 36 years ago."}, {"label": "ENTERTAINMENT", "text": "Her dad even sent her a Kevlar vest."}, {"label": "ENTERTAINMENT", "text": "The \"SNL\" star reacted to criticism that he shouldn't date Ariana Grande because of his borderline personality disorder."}, {"label": "ENTERTAINMENT", "text": "It was bound to happen."}, {"label": "ENTERTAINMENT", "text": "Now we're really curious about the farewell season."}, {"label": "ENTERTAINMENT", "text": "\"Crazy Ex-Girlfriend's\" Vella Lovell pushes back on what old-school male actors see as the \"norm.\""}, {"label": "ENTERTAINMENT", "text": "Some of the actresses who came forward with sexual assault claims against the once powerful Hollywood mogul responded with both surprise and relief."}, {"label": "ENTERTAINMENT", "text": "The bombshell sexual harassment accusations against Weinstein sparked the Me Too movement."}, {"label": "ENTERTAINMENT", "text": "Mayer's hilariously strange \"New Light\" video even spells his name wrong."}, {"label": "ENTERTAINMENT", "text": "An Obi-Wan Kenobi film is also reportedly in development."}, {"label": "WORLD NEWS", "text": "He had canceled the planned June 12 summit less than a day earlier."}, {"label": "POLITICS", "text": "Stone's contact with Julian Assange reportedly told him he couldn't ask WikiLeaks favors \"every other day.\""}, {"label": "POLITICS", "text": "\"Publix knows we're not going away,\" one gun-control activist said."}, {"label": "POLITICS", "text": "“Our results suggest that, given narrow margins of victories in each vote, bots’ effect was likely marginal but possibly large enough to affect the outcomes.\""}, {"label": "WEIRD NEWS", "text": "\"The formerly wet bag of socks... has become crusty,\" tweeted a reporter who thrice spotted the socks."}, {"label": "POLITICS", "text": "A videographer made fun of the far-right extremist group online, so they showed up at his house."}, {"label": "POLITICS", "text": "Godlessness. Too many doors in schools. Ritalin. Guess what's not on the list?"}, {"label": "POLITICS", "text": "Catholic hospital systems are pushing Trump to expand “conscience rights” – even though faith-based medicine has nearly killed some of their patients."}, {"label": "POLITICS", "text": "Unions denounced the president's actions an “assault on democracy.”"}, {"label": "IMPACT", "text": "“Together they will influence markets all over the world on a scale we’ve never seen before.”"}, {"label": "WOMEN", "text": "There's a delicious schadenfreude in seeing a powerful abuser finally held accountable."}, {"label": "WOMEN", "text": "\"Welcome to adulthood. You have a favorite spatula now.\""}, {"label": "QUEER VOICES", "text": "Can you believe?"}, {"label": "QUEER VOICES", "text": "“You guys are watching too much RuPaul.”"}, {"label": "QUEER VOICES", "text": "Mainstream pop culture isn’t the only thing to potentially benefit from the show’s continued prominence."}, {"label": "WEIRD NEWS", "text": "The market owner won't sell octopus products after playing hide-and-seek with a friendly cephalopod."}, {"label": "WORLD NEWS", "text": "A top Pyongyang official lambasted \"political dummy\" Mike Pence and cautioned the U.S. against making \"ignorant\" remarks."}, {"label": "WORLD NEWS", "text": "It's not clear who was operating the missile that hit the plane over eastern Ukraine in 2014, killing 298 people."}, {"label": "WORLD NEWS", "text": "North Korea has conducted all six of its nuclear tests at the Punggye-ri site."}, {"label": "WORLD NEWS", "text": "Trump’s slapdash attempt at negotiations has left the U.S. isolated from its Asian allies."}, {"label": "POLITICS", "text": "\"The process of writing this book has been so personally meaningful and illuminating for me.\""}, {"label": "COMEDY", "text": "“Then he bites his lip, like, ‘Hmm, girl.’”"}, {"label": "WOMEN", "text": "Eight people told CNN that they were victims of harassment and inappropriate behavior by the actor."}, {"label": "SPORTS", "text": "“I never want to put restrictions on the speech of our players.\""}, {"label": "ENTERTAINMENT", "text": "No \"Bad Blood\" here."}, {"label": "ENTERTAINMENT", "text": "Stephen McFeely and Christopher Markus clarify when Thanos may have acquired the Infinity Gauntlet."}, {"label": "ENTERTAINMENT", "text": "Sure it's gross, but you're still here."}, {"label": "ENTERTAINMENT", "text": "Co-star Nick Offerman also seemed on board... under one (incredible) condition."}, {"label": "COMEDY", "text": "Colbert follows Trump \"down the rabbit hole.\""}, {"label": "COMEDY", "text": "“Stop trying to make ‘Fetch’ happen.\""}, {"label": "BUSINESS", "text": "The investigation could lead to new U.S. tariffs similar to those imposed on imported steel and aluminum in March."}, {"label": "BLACK VOICES", "text": "Jessica Bain scored the black history and culture fellowship at Spotify."}, {"label": "BLACK VOICES", "text": "Charlema Webb's husband thought she meant actual pen-to-paper highlighters."}, {"label": "POLITICS", "text": "\"Trump's more concerned about Tomi Lahren being splashed with water than Flint still being entirely without safe water.\""}, {"label": "POLITICS", "text": "Trump cited North Korea’s “tremendous anger and open hostility” in calling off the June 12 Singapore meeting."}, {"label": "POLITICS", "text": "The lawmaker is reportedly one of at least 50 investors in the winery, though the company said they were not involved in the party."}, {"label": "POLITICS", "text": "One 16-year-old filed a complaint alleging that a Border Patrol agent \"threw him down and smashed his head into the ground with his boot.\""}, {"label": "POLITICS", "text": "American influence could tip the referendum."}, {"label": "POLITICS", "text": "Emmet Flood, the White House attorney dealing with the Russia probe, was present at a controversial DOJ meeting about the investigation."}, {"label": "POLITICS", "text": "Every Republican on the judiciary committee voted for Wendy Vitter."}, {"label": "POLITICS", "text": "The canceled North Korea summit doesn’t mean the president will be talking to the special counsel anytime soon."}, {"label": "POLITICS", "text": "Danny Alvarez, a married of father of three, was vying for Jefferson County District Court judge in Louisville."}, {"label": "POLITICS", "text": "Other tweeters, including Mexico's former president Vicente Fox, also poked fun at Trump over the news."}, {"label": "POLITICS", "text": "The billionaire Koch brothers’ political network wants to show it will punish Republicans who don’t support its agenda."}, {"label": "SPORTS", "text": "The pardoning of the black heavyweight boxer is only the third posthumous pardon in U.S. history."}, {"label": "ENTERTAINMENT", "text": "She even got to personally push the button to transfer the funds."}, {"label": "ENTERTAINMENT", "text": "The bee is the symbol of the city and is incorporated into the Manchester coat of arms."}, {"label": "ENTERTAINMENT", "text": "\"4 years down and forever to go....\""}, {"label": "ENTERTAINMENT", "text": "What a god."}, {"label": "ENTERTAINMENT", "text": "Dylan Farrow called her brother's essay \"beyond hurtful\" and \"easily disproven.\""}, {"label": "ENTERTAINMENT", "text": "The film producer allegedly made advances on her years ago, but her then-boyfriend made sure it didn't happen again."}, {"label": "ENTERTAINMENT", "text": "The horror master also took on \"creepy\" Mike Pence: \"He has that look.\""}, {"label": "ENTERTAINMENT", "text": "\"We should be grieving with Jessica Walter. That shouldn't have happened to her.\""}, {"label": "ENTERTAINMENT", "text": "\"In like almost 60 years of working, I’ve never had anybody yell at me like that on a set,\" the actress said."}, {"label": "ENTERTAINMENT", "text": "Authorities in New York have been investigating the former producer for alleged sexual abuse and harassment."}, {"label": "COMEDY", "text": "\"I’m serious. It’s awful. And we don’t actually need it.\""}, {"label": "POLITICS", "text": "Before he was Trump's embattled EPA chief, Pruitt was a state politician who backed draconian abortion restrictions."}, {"label": "POLITICS", "text": "\"Pot meet kettle.\""}, {"label": "POLITICS", "text": "The bill would let lawmakers hide past offenses and only be punished for \"severe or pervasive\" harassment, the ACLU said."}, {"label": "POLITICS", "text": "Legal experts say the suit has some big flaws."}, {"label": "POLITICS", "text": "She plans to get the required number of petition signatures to make it onto the ballot."}, {"label": "POLITICS", "text": "An internal memo obtained by The Washington Post offers a glimpse into the challenges faced by the Trump administration on the issue of climate change."}, {"label": "POLITICS", "text": "Basically: \"It's not me, it's you.\""}, {"label": "WORLD NEWS", "text": "\"We are attempting to make sense of what, precisely, President Trump means.\""}, {"label": "POLITICS", "text": "Sure, this seems like the kind of thing a private company should be in charge of. Welcome to the Facebook Election Commission."}, {"label": "POLITICS", "text": "“Why did you shoot at the girl? You killed her!” a bystander asks in viral video that shows the aftermath of the shooting."}, {"label": "POLITICS", "text": "Senators and human rights groups worry the proposed rule changes will export the U.S. gun violence epidemic."}, {"label": "POLITICS", "text": "The California city recognized her as a “national figure in the resistance to the Trump Administration.\""}, {"label": "IMPACT", "text": "We may not realize it, but retailers are conditioning us to be our own cashiers."}, {"label": "TRAVEL", "text": "Having waterproof covers on the seats is kind of brilliant."}, {"label": "MEDIA", "text": "\"I could go on, but this is just an hour show.\""}, {"label": "MEDIA", "text": "\"NFL DISHONORS THE FLAG\""}, {"label": "POLITICS", "text": "The Supreme Court will likely have to determine whether indefinite detention without a bond hearing violates the Constitution."}, {"label": "POLITICS", "text": "“It’s important that we learn from their experience.\""}, {"label": "QUEER VOICES", "text": "The comedian also \"can't wait\" to play Jennifer Aniston's wife on \"First Ladies.\""}, {"label": "QUEER VOICES", "text": "West Hollywood has also reaffirmed its commitment to being a sanctuary city, opposing the administration’s enforcement of extreme immigration laws."}, {"label": "QUEER VOICES", "text": "It's slated to hit Netflix on June 15th."}, {"label": "QUEER VOICES", "text": "Despite support from Amy Schumer and Susan Sarandon, David Ermold won't challenge Davis this fall."}, {"label": "SPORTS", "text": "The score is love-love."}, {"label": "SPORTS", "text": "\"I don’t think people should be staying in locker rooms,\" Trump told Fox News. \"You have to stand proudly for the national anthem or you shouldn’t be playing.\""}, {"label": "TECH", "text": "A failed startup suggested that Facebook mounted what could be described as mass surveillance."}, {"label": "TECH", "text": "The NTSB published a preliminary report on the incident Thursday."}, {"label": "WEIRD NEWS", "text": "“Unplug your Alexa devices right now. You’re being hacked.”"}, {"label": "WEIRD NEWS", "text": "The driver kept going after a mysterious object struck his car."}, {"label": "WEIRD NEWS", "text": "😻😻😻"}, {"label": "WEIRD NEWS", "text": "The things people do for love. Or at least for prom."}, {"label": "WORLD NEWS", "text": "Hate crimes have increased, extremist groups are growing, and two mass killings shocked the country."}, {"label": "WORLD NEWS", "text": "Italy is on track to have one of the most radical and populist governments in all of Europe."}, {"label": "ENTERTAINMENT", "text": "\"He’s my brother, so it’s hard. I may not have a very clear perspective on it, but I’m trying to.”"}, {"label": "RELIGION", "text": "Paige Patterson was demoted to president emeritus after thousands of evangelical women signed a petition calling for his ouster."}, {"label": "QUEER VOICES", "text": "It seems the current administration doesn't speak for most Americans when it comes to LGBTQ rights."}, {"label": "ENTERTAINMENT", "text": "The TV singing competition's new champion just turned 15."}, {"label": "POLITICS", "text": "The education secretary said it's a local decision, but she didn't argue against it."}, {"label": "POLITICS", "text": "The lawsuit is the latest of several targeting the Infowars conspiracy theorist."}, {"label": "POLITICS", "text": "The upset comes after widespread teacher protests over pension and education budget cuts."}, {"label": "POLITICS", "text": "The former sheriff ― the first Latina nominated for Texas governor by a major party ― now faces GOP Gov. Greg Abbott."}, {"label": "POLITICS", "text": "Evgeny Freidman has been Cohen’s partner in the taxi business for years."}, {"label": "SPORTS", "text": "Was it supposed to be Gary Busey or Mickey Rooney?"}, {"label": "SCIENCE", "text": "The researchers plan to scour the Loch Ness next month for evidence of its supposed inhabitant."}, {"label": "COMEDY", "text": "\"When people see me -- a portly, soft-chinned white male -- wearing a red hat from a distance, they assume the worst.\""}, {"label": "COMEDY", "text": "\"Well, this is insanely exciting,\" the actress said about the news."}, {"label": "BLACK VOICES", "text": "She’s paying tribute to Barack Obama and their 25-year marriage with a sweet photo from their 1992 wedding."}, {"label": "BLACK VOICES", "text": "There’s a reason the voice of Shuri’s artificial intelligence computer system sounded so familiar — at least to those who routinely watch Comedy Central."}, {"label": "BLACK VOICES", "text": "\"The One True Donald.\""}, {"label": "BLACK VOICES", "text": "The officer, working as a security guard, is accused of punching one woman in the head, then holding her and another woman to the ground."}, {"label": "WORLD NEWS", "text": "Dr. Claire Karekezi says the genocide is what made her understand that \"we cannot count on anyone but ourselves.\""}, {"label": "POLITICS", "text": "If elected, the former party leader in the state legislature would be the nation’s first black female governor."}, {"label": "COMEDY", "text": "Under $1 million?"}, {"label": "BLACK VOICES", "text": "\"I was black and from a working-class neighborhood in Chicago, while Princeton’s student body was generally white and well-to-do.\""}, {"label": "ENTERTAINMENT", "text": "Two stomach-churning events, featured back-to-back in the last episode, have divided viewers."}, {"label": "ENTERTAINMENT", "text": "We will always think of Madonna‘s daughter Lourdes “Lola” Leon as this big-eyed little beauty."}, {"label": "ENTERTAINMENT", "text": "It's both impressive and kind of scary."}, {"label": "ENTERTAINMENT", "text": "It wasn’t a prank, per se. That’s Pitt-Clooney ground."}, {"label": "ENTERTAINMENT", "text": "\"If he walked into a restaurant I was in, I’d walk out.\""}, {"label": "ENTERTAINMENT", "text": "The singer called their two-year relationship \"toxic\" and \"scary.\""}, {"label": "ENTERTAINMENT", "text": "Multiple scenes in which a dog’s genitals are groped have sparked criticism."}, {"label": "ENTERTAINMENT", "text": "The Foo Fighters star said he's ashamed of the president."}, {"label": "ENTERTAINMENT", "text": "Oops!"}, {"label": "ENTERTAINMENT", "text": "The \"Ocean's 8\" star delivered in imitating Drew Barrymore and a dolphin."}, {"label": "ENTERTAINMENT", "text": "\"Love Shack\" became a hit nearly 30 years ago. Singer Kate Pierson reveals how the song came to be."}, {"label": "POLITICS", "text": "The Iraq War veteran will now face GOP Rep. Will Hurd in November. She'll make history if she wins."}, {"label": "POLITICS", "text": "McGrath's victory continues the success women and political newcomers have found in Democratic primaries."}, {"label": "POLITICS", "text": "The president, who just unveiled new restrictions on abortion services, sought the support of anti-abortion activists at Susan B. Anthony List's annual gala."}, {"label": "POLITICS", "text": "The civil liberties group says Ohio's map is so heavily gerrymandered, it violates the Constitution."}, {"label": "POLITICS", "text": "Santa Fe, unlike Parkland, doesn't seem to be significantly driving new calls for gun control."}, {"label": "ENTERTAINMENT", "text": "“The president spelled ‘Illinois’ wrong in his tweet, but it still counts, right?”"}, {"label": "ENTERTAINMENT", "text": "“I get ‘Dad, put a shirt on,’ all the time,” the actor explained."}, {"label": "ENTERTAINMENT", "text": "The classic story is getting a modern re-telling with original music."}, {"label": "CRIME", "text": "The victims, who are now adults, were enrolled in a church-run program designed to give troubled teens a safe place to live."}, {"label": "SPORTS", "text": "Teams can set their own policies for punishing players."}, {"label": "COMEDY", "text": "\"Notice anything different about this royal wedding?\""}, {"label": "POLITICS", "text": "But they might need a reality check."}, {"label": "POLITICS", "text": "Republicans have been demanding a look at documents about whether Obama planted a spy in the Trump campaign."}, {"label": "POLITICS", "text": "In an ad, Brian Kemp said he would round up undocumented immigrants and \"take them home myself.\""}, {"label": "WEIRD NEWS", "text": "Michael Rotondo was court-ordered to move out of his parents’ home."}, {"label": "POLITICS", "text": "The top Democratic leaders warned a Republicans-only meeting would set a bad precedent for the Justice Department."}, {"label": "IMPACT", "text": "Your next boss could be an algorithm"}, {"label": "POLITICS", "text": "The president hailed the Fox News pundit as a “respected young woman.”"}, {"label": "POLITICS", "text": "Except the White House press secretary gives false and misleading information all the time."}, {"label": "POLITICS", "text": "The president's Twitter feed is a \"public forum,\" the judge found."}, {"label": "POLITICS", "text": "The Babylon Brigade is led by a Christian but is tied to the brutal Iranian-backed Muslim paramilitary Badr Organization."}, {"label": "POLITICS", "text": "The state's fourth-largest union had backed the Democratic congresswoman two years ago."}, {"label": "POLITICS", "text": "The president's son-in-law had been using a temporary security clearance while the FBI performed a background check."}, {"label": "POLITICS", "text": "“The callousness that our country has for life is very disturbing,\" GOP candidate Wendy Rogers said."}, {"label": "POLITICS", "text": "McBath, whose son was shot dead in 2012, will be facing businessman Kevin Abel in a Democratic primary runoff on July 24."}, {"label": "WEIRD NEWS", "text": "Finding a guy tall enough to play Chewbacca who could dance was a challenge, according to the director."}, {"label": "POLITICS", "text": "Lawyer Lizzie Fletcher beat progressive activist Laura Moser in a district Democrats hope to take from the GOP."}, {"label": "POLITICS", "text": "It would require lawmakers to pay out of pocket for their misconduct, which some Republicans fought for months."}, {"label": "TRAVEL", "text": "Charming towns, relaxing beaches and top hiking destinations await."}, {"label": "TRAVEL", "text": "Star Wars: Galaxy's Edge will open at Disneyland before Disney World."}, {"label": "COMEDY", "text": "These goofy animals are just like us."}, {"label": "COMEDY", "text": "\"I have a surprise for you. It’s a golden unicycle.\""}, {"label": "WORLD NEWS", "text": "Archbishop Philip Wilson knew about the abuse of four boys dating back to the 1970s and did nothing."}, {"label": "WORLD NEWS", "text": "A senior Iranian military commander poured scorn on U.S. threats to tighten sanctions."}, {"label": "WORLD NEWS", "text": "He was warned he might be \"the genius that created a digital monster that is destroying our democracies.\""}, {"label": "ENTERTAINMENT", "text": "\"Thinking of you all today and every day.\""}, {"label": "ENTERTAINMENT", "text": "So that means she and Orlando Bloom are definitely on again -- right?"}, {"label": "BLACK VOICES", "text": "\"I hate that anyone at all might possibly be afraid of me.\""}, {"label": "BLACK VOICES", "text": "Facial recognition software often does not properly identify darker-skinned people."}, {"label": "ENTERTAINMENT", "text": "Yeah, she wrecked him. In the balls."}, {"label": "ENTERTAINMENT", "text": "Trump is accused of having an affair with former porn star Stormy Daniels in 2006."}, {"label": "ENTERTAINMENT", "text": "Skills and showmanship, people."}, {"label": "ENTERTAINMENT", "text": "The \"Solo\" star's Wookiee mistake is pretty hilarious."}, {"label": "ENTERTAINMENT", "text": "\"I win either way,\" second-place finisher Caleb Lee Hutchinson said."}, {"label": "COMEDY", "text": "He tried not to. He really did."}, {"label": "COMEDY", "text": "\"It’s not fair that a president who won’t read a two-page press briefing makes us read a six-part Twitter rant.\""}, {"label": "BLACK VOICES", "text": "Malachi Pearson's story resonated with people of color on Twitter, who shared their own heartbreaking experiences of racism at school."}, {"label": "BLACK VOICES", "text": "\"If you want to see a video of racial profiling, this is the poster child right here,\" an attorney said."}, {"label": "BLACK VOICES", "text": "\"There is no excuse for such threatening statements,\" an ACLU attorney said."}, {"label": "CRIME", "text": "The gunman was found dead after soaking his apartment in gasoline."}, {"label": "ENTERTAINMENT", "text": "\"How can you not be pansexual in space?\" he said."}, {"label": "ENTERTAINMENT", "text": "The film has reportedly been in the works since before the former network CEO's death last year."}, {"label": "POLITICS", "text": "Adam Putnam, a self-described \"NRA sellout\" running for Florida governor, received $670,000 from the company."}, {"label": "POLITICS", "text": "The recommendation comes days after the Manhattan district attorney pledged to stop prosecuting low-level marijuana cases."}, {"label": "POLITICS", "text": "A publicly available 2017 assessment from the intelligence community concluded that Russia meddled in the 2016 election with a preference for Donald Trump."}, {"label": "POLITICS", "text": "So Mexico's not paying for it?"}, {"label": "POLITICS", "text": "Trump wants to know whether an FBI informant infiltrated his campaign for political purposes."}, {"label": "ENTERTAINMENT", "text": "And how he almost embarrassed himself on a global scale."}, {"label": "ENTERTAINMENT", "text": "Both recently broke it off with their long-term partners."}, {"label": "ENTERTAINMENT", "text": "\"...with butchery and injustice for the most innocent of all.\""}, {"label": "ENTERTAINMENT", "text": "The comedian had a few thoughts on the royal wedding too."}, {"label": "COMEDY", "text": "The \"Jimmy Kimmel Live\" host says they'd believe in lizard people... if Trump said it first."}, {"label": "COMEDY", "text": "This is royally funny."}, {"label": "POLITICS", "text": "And here's a look at other key races in Tuesday's voting in four states."}, {"label": "QUEER VOICES", "text": "2017 had the lowest percentage of queer movie characters in five years."}, {"label": "QUEER VOICES", "text": "This inclusivity is G-L-A-M-O-R-O-U-S."}, {"label": "POLITICS", "text": "The contest between Stacey Abrams and Stacey Evans is a battle of divergent political strategies."}, {"label": "POLITICS", "text": "The bill would expand the list of those who can petition to take away firearms beyond family, roommates and police."}, {"label": "POLITICS", "text": "Retired fighter pilot Amy McGrath’s upstart primary campaign thinks it's found a way to talk to disaffected voters."}, {"label": "POLITICS", "text": "The coin’s depiction of Trump with the North Korean dictator has been called inappropriate and un-American."}, {"label": "POLITICS", "text": "“It was sort of like a gift,\" Giuliani said of the Clinton campaign material stolen by Russia. \"And you’re not involved in the illegality of getting it.”"}, {"label": "POLITICS", "text": "\"The article is an absolutely disgusting piece that lacks any place in journalism; even in your Onion.”"}, {"label": "POLITICS", "text": "Their agenda would steer $100 billion toward schools and salaries and guarantee teachers' right to join unions."}, {"label": "POLITICS", "text": "“I suspect the president of the United States is sophisticated enough to know what he should or shouldn’t be talking about on an unsecured line,” Sen. Jim Risch said."}, {"label": "WEIRD NEWS", "text": "Tastes as good as it sounds (unfortunately)."}, {"label": "WEIRD NEWS", "text": "They have a warning prepped for this?"}, {"label": "POLITICS", "text": "Lawmakers have passed a bill to roll back regulations adopted after the 2008 financial crisis."}, {"label": "POLITICS", "text": "One person wondered if the hole was Melania's escape tunnel."}, {"label": "POLITICS", "text": "Add this to the long, ever-growing list of scandals for the EPA chief."}, {"label": "POLITICS", "text": "The chess champ and dissident sounds the gong again on Vladimir Putin's manipulation of U.S. democracy."}, {"label": "TRAVEL", "text": "These underrated travel destinations in Europe won't be full of tourists."}, {"label": "LATINO VOICES", "text": "In the apology, Aaron Schlossberg claims he moved to New York because of all the diversity."}, {"label": "MEDIA", "text": "Lesley Stahl said Trump admitted that he attacks journalists so \"no one will believe\" them."}, {"label": "POLITICS", "text": "The president is said to use a cellphone that lacks top security features and ignores advice to regularly swap his Twitter phone."}, {"label": "POLITICS", "text": "The court denied a motion to dismiss Grimm's lawsuit against the Gloucester County School Board."}, {"label": "POLITICS", "text": "Trump has asked the Justice Department to look into whether an FBI informant infiltrated his campaign for political purposes."}, {"label": "POLITICS", "text": "The Asian country’s energy needs are growing and coal power is a tempting solution."}, {"label": "POLITICS", "text": "That percentage has barely budged since last year."}, {"label": "POLITICS", "text": "Forget restricting guns as a way to curb school shootings. \"It's a Second Amendment right, not a Second Amendment suggestion.\""}, {"label": "RELIGION", "text": "\"For a moment we were actually together, organized around love,” Curry said."}, {"label": "QUEER VOICES", "text": "And her justification is pretty romantic. 💕"}, {"label": "POLITICS", "text": "The state has a child access prevention law, but it doesn't appear to be working as intended."}, {"label": "QUEER VOICES", "text": "Aaron Salazar's family said authorities have been looking into the possibility of attempted suicide, but they don't believe he would take his own life."}, {"label": "QUEER VOICES", "text": "She and Mike Pence had a \"great conversation,\" however."}, {"label": "QUEER VOICES", "text": "“Your organization is not the Boy Scouts anymore,” the employee reportedly said."}, {"label": "TECH", "text": "And no one will know when you use it."}, {"label": "WEIRD NEWS", "text": "\"I can’t believe I’m the first one to ever write ‘Summa Cum Laude’ on a cake.”"}, {"label": "WOMEN", "text": "\"Fact is, I can fly an £80m jet, you can’t.\""}, {"label": "WOMEN", "text": "Low-wage workers are fighting back with the help of Hollywood donors."}, {"label": "WORLD NEWS", "text": "The State Department has already announced that the U.S. will not recognize the election result."}, {"label": "WORLD NEWS", "text": "“We have to preserve this agreement so we don’t have to negotiate a new agreement,” the EU's energy chief said."}, {"label": "WORLD NEWS", "text": "\"It was organized fascists who attacked me as a person and as a mayor,\" Yannis Boutaris said."}, {"label": "ENTERTAINMENT", "text": "This was not the first moment addressing gun violence at the awards show."}, {"label": "BLACK VOICES", "text": "The Tamir Rice Afrocentric Cultural Center will help usher children into the future her son will never have."}, {"label": "POLITICS", "text": "Plaintiffs complained that the state violated the 1993 National Voter Registration Act."}, {"label": "ENTERTAINMENT", "text": "\"Why don't we change what's happening?\""}, {"label": "BLACK VOICES", "text": "The Pulitzer Prize-winning artist gave her another shot."}, {"label": "RELIGION", "text": "His words, reportedly uttered in private, have been described as the most progressive remarks ever made by a modern pontiff about homosexuality."}, {"label": "SCIENCE", "text": "The supposed \"interstellar immigrant\" is located near Jupiter but has an atypical orbit."}, {"label": "IMPACT", "text": "“People didn’t view me seriously because I was a 15-year-old girl.”"}, {"label": "POLITICS", "text": "Any action is an \"effort to silence me,\" the controversial political operative said."}, {"label": "POLITICS", "text": "The New York governor faces former \"Sex and the City\" star Cynthia Nixon in the Democratic primary."}, {"label": "POLITICS", "text": "A new ruling allows employers to force workers into class-action waivers. As one justice put it, the case cuts to \"the entire heart of the New Deal.\""}, {"label": "POLITICS", "text": "A Texas newspaper filed a lawsuit alleging the Calhoun Port Authority hired the disgraced former lawmaker without public notice, in violation of state law."}, {"label": "QUEER VOICES", "text": "The author hopes \"The Music of What Happens\" will inspire readers to fall in love ... and think twice about gender roles."}, {"label": "QUEER VOICES", "text": "A new documentary examines the \"culture of exclusion, bigotry and discrimination\" in pro sports."}, {"label": "ENTERTAINMENT", "text": "This is postpartum life unfiltered."}, {"label": "ENTERTAINMENT", "text": "\"It felt like the world was becoming a better place,\" Aaron Korsh wrote of the ceremony involving his friend, Meghan Markle."}, {"label": "ENTERTAINMENT", "text": "You have a few options this week, including a new Gillian Jacobs movie."}, {"label": "ENTERTAINMENT", "text": "Netflix announced a deal with Barack and Michelle Obama to produce a variety of films and series."}, {"label": "ENTERTAINMENT", "text": "Ther-oh-my-God!"}, {"label": "POLITICS", "text": "\"If you can't beat 'em, join 'em,\" Clinton said, in a pretty obvious nod to the Russians."}, {"label": "POLITICS", "text": "“We can’t let our guy go in and be questioned without knowing this,” the president's lawyer said."}, {"label": "POLITICS", "text": "It's a revival of a successful tactic Dems used in 2006, when they took control of both chambers of Congress."}, {"label": "ENTERTAINMENT", "text": "The star veered from the traditional script, refusing to give the customary “moment of silence,” and tearfully calling for action instead."}, {"label": "POLITICS", "text": "Our poll showed some surprising generational divides."}, {"label": "POLITICS", "text": "Most of those following the Trump-Russia investigation via the cable news outlet say they strongly disapprove of the special counsel's job performance."}, {"label": "POLITICS", "text": "The proposal would allow hunters to kill bear cubs and wolf pups in their dens and shoot swimming caribou from motorboats."}, {"label": "POLITICS", "text": "Trump told Stern: \"You know who’s a great beauty? My daughter Ivanka. Now she’s a 10.\""}, {"label": "POLITICS", "text": "The Me Too movement takes a massive hit from a new decision written by Justice Neil Gorsuch."}, {"label": "ENTERTAINMENT", "text": "\"Deadpool 2\" was the third-biggest debut of the year behind Marvel blockbusters “Avengers: Infinity War” and “Black Panther.”"}, {"label": "ENTERTAINMENT", "text": "Forget Shogun World. Did you catch that scene between Dolores and Teddy?"}, {"label": "ENTERTAINMENT", "text": "The experience was \"weird, but beautiful,\" Glover said."}, {"label": "ENTERTAINMENT", "text": "In an interview with HuffPost, Nate Moore said he asked the Russo brothers to reconsider the death."}, {"label": "ENTERTAINMENT", "text": "*Sends giftbasket to Marvel*"}, {"label": "BLACK VOICES", "text": "She delivered an iconic performance and speech, too."}, {"label": "CRIME", "text": "A case of road rage in Texas quickly escalated into a hateful and xenophobic diatribe."}, {"label": "ENTERTAINMENT", "text": "The new documentary “That Summer,” a de facto prequel, brings the eccentric Edies back to life in an era dominated by attention-starved mini-celebrities."}, {"label": "BLACK VOICES", "text": "“Feeding the homeless is the highlight of my life,” Austin Perine said."}, {"label": "COMEDY", "text": "Monarchy, love and fast food."}, {"label": "COMEDY", "text": "Watch him try to rehabilitate the rehab biz."}, {"label": "BLACK VOICES", "text": "“This is the biggest accomplishment of my career.”"}, {"label": "QUEER VOICES", "text": "Mounir Mahjoubi hopes his experience will inspire other LGBTQ people."}, {"label": "QUEER VOICES", "text": "\"Girl\" was deemed \"a stunning debut\" for its director and star."}, {"label": "QUEER VOICES", "text": "Martin hopes his journey will inspire young LGBTQ people."}, {"label": "POLITICS", "text": "The outside groups can spend big to alter election outcomes, but don't have to disclose donors until after the voting."}, {"label": "WEIRD NEWS", "text": "Alcohol may have been involved."}, {"label": "POLITICS", "text": "The secretary of state avoided specifics on how he would convince  the rest of the world to abandon the existing nuclear accord."}, {"label": "TRAVEL", "text": "If you’re dreaming about a romantic European getaway that doesn’t involve a gazillion tourists, then consider these beautiful isles."}, {"label": "WORLD NEWS", "text": "The three Cuban women who survived the crash were in critical condition, a hospital official said."}, {"label": "POLITICS", "text": "\"Right now, we have agreed to put the tariffs on hold while we try to execute the framework.\""}, {"label": "POLITICS", "text": "Larry Kudlow dodges when asked about the president’s attacks on the retail giant."}, {"label": "POLITICS", "text": "But they don't yet have the public support of the president -- and Mitch McConnell is delaying a vote on proposed sanctions for perpetrators of the crisis."}, {"label": "POLITICS", "text": "Trump's lawyer told The New York Times he got the timeline from the special counsel's office two weeks ago."}, {"label": "BLACK VOICES", "text": "Announcers said the gospel choir sang \"beautifully black\" and described black guests as \"exotic.\""}, {"label": "ENTERTAINMENT", "text": "She's famous for playing so-and-so's teenage daughter. But 17 years into her career, Newton is anxious for a change."}, {"label": "POLITICS", "text": "Once an outsider, her radical economic thinking won over Wall Street. Now she's changing the Democratic Party."}, {"label": "POLITICS", "text": "Gov. Greg Abbott was dragged on social media over the seemingly tone-deaf contest."}, {"label": "COMEDY", "text": "John Goodman's Tillerson croons: \"Don't forget I regret what I did for Trump.\""}, {"label": "COMEDY", "text": "Kate's tipsy."}, {"label": "BUSINESS", "text": "The new policy was unveiled weeks after the controversial arrest of two black men at a Philadelphia Starbucks."}, {"label": "COMEDY", "text": "Things look black."}, {"label": "ENTERTAINMENT", "text": "The festival was Weinstein’s “hunting ground,” she said."}, {"label": "ENTERTAINMENT", "text": "This week's host did not fare well."}, {"label": "POLITICS", "text": "\"For [Texas Lt. Gov. Dan Patrick] to be making those moronic comments? Unacceptable.”"}, {"label": "POLITICS", "text": "The president tried to smear the credibility of special counsel Robert Mueller's investigation yet again."}, {"label": "ENTERTAINMENT", "text": "Meet Miles Theodore!"}, {"label": "POLITICS", "text": "\"Our teachers are part of that well-run militia\" mentioned in the Second Amendment, he said."}, {"label": "MEDIA", "text": "\"We make these sick people known worldwide for their horrifying acts, let’s stop that.\""}, {"label": "POLITICS", "text": "The Justice Department responded by asking its inspector general to look into Trump's charge."}, {"label": "POLITICS", "text": "The student who posted the photo called Carrey's depiction \"disgusting.\""}, {"label": "POLITICS", "text": "The incoming NRA president, who once promoted a violent video game, also cited a \"culture of violence.\""}, {"label": "COMEDY", "text": "\"I thought it would be more extravagant.\""}, {"label": "COMEDY", "text": "\"We sat there confused as the bride smacked the groom in the face.\""}, {"label": "LATINO VOICES", "text": "Aaron Schlossberg was treated to outrage, mariachi music and español outside his home."}, {"label": "ENTERTAINMENT", "text": "There's a new Natalie Dormer show."}, {"label": "ENTERTAINMENT", "text": "They should cover everything."}, {"label": "ENTERTAINMENT", "text": "He'll always be a king of comedy, but what Cedric Kyles really wants to be is a dramatic actor."}, {"label": "POLITICS", "text": "“To see our elected leaders do nothing over and over again, it’s just an incredibly sad situation.”"}, {"label": "POLITICS", "text": "Even his own mom calls him a bigot, but former judge Vickers Cunningham insists his opposition to interracial and same-sex marriage didn't affect his rulings."}, {"label": "POLITICS", "text": "\"I’ve hit rock bottom and I am not interested in your views as it pertains to this issue,\" he said."}, {"label": "SPORTS", "text": "How \"The Star-Spangled Banner\" became a part of American sports culture."}, {"label": "ENTERTAINMENT", "text": "The 2017 inauguration crowd continues to be a wellspring of humor."}, {"label": "CRIME", "text": "Authorities confirmed the deaths of 10 people in the mass shooting. Here are their stories."}, {"label": "IMPACT", "text": "Tech entrepreneur Dan Price is working to curb the dangers of \"unbridled capitalism.\""}, {"label": "POLITICS", "text": "The crown princes of the UAE and Saudi Arabia offered help to the Trump presidential campaign, the New York Times reports."}, {"label": "POLITICS", "text": "Has \"Melanie\" signed an NDA?"}, {"label": "POLITICS", "text": "\"They sit there with their hands in their pockets, pockets that are full of gun money, and they do nothing.\""}, {"label": "COMEDY", "text": "\"My kids use air quotes when they call me 'a lawyer.'\""}, {"label": "ENTERTAINMENT", "text": "There's a well-reviewed documentary about bourbon."}, {"label": "POLITICS", "text": "The teens organized the protest in response to the Texas school shooting earlier that day."}, {"label": "WOMEN", "text": "Nope nope nope nope nope nope nope."}, {"label": "WORLD NEWS", "text": "Britain has accused Russia of being behind the nerve agent attack, but Russia has denied any involvement."}, {"label": "WORLD NEWS", "text": "The plane went down shortly after takeoff from Havana's Jose Marti airport."}, {"label": "WORLD NEWS", "text": "The president assured Kim Jong Un he can stay in power if he gives up his nuclear arsenal."}, {"label": "ENTERTAINMENT", "text": "OMG!"}, {"label": "TECH", "text": "The firm at the center of the Facebook data hack made the decision after suffering a sharp drop in business."}, {"label": "POLITICS", "text": "A small group took part in the national protest on April 20."}, {"label": "COMEDY", "text": "\"The Break with Michelle Wolf\" starts May 27."}, {"label": "POLITICS", "text": "The attorney general ordered judges to stop administratively closing cases, whether they think it's best or not."}, {"label": "POLITICS", "text": "Many in Congress are furious over a White House aide joking that McCain is \"dying anyway.\""}, {"label": "COMEDY", "text": "Sounds painful."}, {"label": "ENTERTAINMENT", "text": "The two have been married since 2012 and have three girls."}, {"label": "POLITICS", "text": "The rapper said he and the president had become the focus of the summit."}, {"label": "POLITICS", "text": "Providers like Planned Parenthood would lose funding for essential health checks like breast cancer screenings."}, {"label": "POLITICS", "text": "\"We’ll try and keep that in mind when your parole hearings come up,\" one Twitter user told the president."}, {"label": "RELIGION", "text": "It's the first time all the bishops in one country have offered to step down over the church's sex abuse scandal."}, {"label": "ENTERTAINMENT", "text": "“I wish there was more that I could fix.\""}, {"label": "ENTERTAINMENT", "text": "*Patiently waits for first photo*"}, {"label": "ENTERTAINMENT", "text": "\"#BaldwinitosEverywhere,\" the actor wrote."}, {"label": "ENTERTAINMENT", "text": "\"It wasn't as hard as I thought.\""}, {"label": "ENTERTAINMENT", "text": "It started in late 2006, when she attended a two-day introduction to Jness in Vancouver."}, {"label": "POLITICS", "text": "It's over."}, {"label": "ENTERTAINMENT", "text": "Tig Notaro is set to star as her wife, as well as write the script."}, {"label": "ENTERTAINMENT", "text": "2018's cast is much more diverse."}, {"label": "ENTERTAINMENT", "text": "\"I will defend myself against these false accusations,\" Tinsley said in a statement."}, {"label": "ENTERTAINMENT", "text": "Welcome to the next chapter in the decline of civilization."}, {"label": "ENTERTAINMENT", "text": "...and she didn't even get invited to the royal wedding."}, {"label": "POLITICS", "text": "He's been hounded by reporters and may get a surprise serenade from a mariachi band."}, {"label": "MEDIA", "text": "\"Mueller is causing irreparable damage to the rule of law in this country.”"}, {"label": "POLITICS", "text": "“The threat of a pandemic is serious, and it’s important families know we have a vigilant and experienced team in place.”"}, {"label": "POLITICS", "text": "A recently released survey of the two groups finds minimal gaps in support for many key policies."}, {"label": "POLITICS", "text": "\"We're tired of paying you in exchange for your useless prayers,\" one Twitter user told the senator."}, {"label": "POLITICS", "text": "Another concern for some gun rights activists is that the state bans do not give enough notice to residents that possessing a bump stock is, in most cases, a felony."}, {"label": "POLITICS", "text": "He’s betting that a campaign to impeach Donald Trump will turn out infrequent voters in November. What could go wrong?"}, {"label": "POLITICS", "text": "The Republican senator's campaign gave the cash to his son to run its Instagram page and make Facebook and YouTube videos."}, {"label": "POLITICS", "text": "The agency took six months to even respond to a federal probe into Zinke's apparent effort to bully Sen. Lisa Murkowski over her health care vote."}, {"label": "ENTERTAINMENT", "text": "The actress makes an intriguing observation."}, {"label": "ENTERTAINMENT", "text": "Melissa McCarthy and a puppet join forces to solve murders in Los Angeles."}, {"label": "ENTERTAINMENT", "text": "As the actor filmed a scene for an upcoming movie, all Twitter could see was Harry Potter."}, {"label": "POLITICS", "text": "“So I was able to explain that those are rarely confused with each other,” the tech mogul said."}, {"label": "ENTERTAINMENT", "text": "Why do you insist on ruining our snarky fun, ABC?"}, {"label": "ENTERTAINMENT", "text": "\"I got a lot of sh** for it,\" the Aerosmith rocker confessed to James Corden."}, {"label": "CRIME", "text": "Federal prosecutors allege Melanie Murphey and others at Novus Health Services in Texas were trying to maximize profits."}, {"label": "COMEDY", "text": "“Well congrats to you too, old pal.\""}, {"label": "CRIME", "text": "\"He's really lucky to be alive,\" a neighbor said."}, {"label": "POLITICS", "text": "\"He doesn't know this yet,\" Trump admitted."}, {"label": "POLITICS", "text": "The president reportedly doesn’t know the difference between HIV and HPV, but he still wants to penalize family planning providers."}, {"label": "POLITICS", "text": "Obstruction of justice charges are reportedly central to the special counsel's Russia investigation."}, {"label": "IMPACT", "text": "Fifteen million people have it, yet it remains in the shadows."}, {"label": "ENTERTAINMENT", "text": "It's made nearly $20 million before even officially opening."}, {"label": "POLITICS", "text": "The messy health insurance exchange market was starting to settle down before Trump came along."}, {"label": "POLITICS", "text": "All 216 things."}, {"label": "POLITICS", "text": "The guilty plea agreement could add to the legal pressure on Manafort."}, {"label": "POLITICS", "text": "“On another note, a very positive note, I'm honored to be here ...\""}, {"label": "COMEDY", "text": "“Now, let me tell you one of the bajillion reasons why this episode was poison.\""}, {"label": "POLITICS", "text": "He said humans are contributing in a \"major way\" to climate change after years of refusing to acknowledge that fact."}, {"label": "POLITICS", "text": "A fight over immigration ended up tanking the farm bill."}, {"label": "QUEER VOICES", "text": "A Republican running in a district that includes part of Los Angeles County documented her restroom confrontation in a shocking viral video."}, {"label": "QUEER VOICES", "text": "He looked to \"Call Me by Your Name\" to visually inspire the 1980s-themed video."}, {"label": "WEIRD NEWS", "text": "This time, you can change what you hear with your mind."}, {"label": "WEIRD NEWS", "text": "The 25 most profound “Shower Thoughts” on Reddit from the last week."}, {"label": "WOMEN", "text": "\"Coffee mugs do a lot of heavy lifting when it comes to personality in the workplace.\""}, {"label": "WORLD NEWS", "text": "HuffPost Italia obtained a document that shows what Italy's next government could look like."}, {"label": "POLITICS", "text": "Congress could make all companies allow workplace sexual harassment victims to go to court. But the bipartisan legislation seems to have stalled."}, {"label": "POLITICS", "text": "The 666 Fifth Avenue property may have found its savior."}, {"label": "POLITICS", "text": "The president has a history of claiming to donate to charities without providing proof."}, {"label": "POLITICS", "text": "Though jurors acquitted the first defendants, the government is pursuing multiple felony charges against four more."}, {"label": "POLITICS", "text": "The Freedom Caucus comes out against the farm bill until Republicans work out an immigration plan."}, {"label": "POLITICS", "text": "By Frank Bass, MapLight More than five dozen congressmen who have retired or plan to retire next year have raised at least"}, {"label": "POLITICS", "text": "Somehow, the farm bill may hinge on immigration."}, {"label": "QUEER VOICES", "text": "Someone stole the Rev. David Meredith’s ordination certificate. So his congregation plastered his office door with their own certificates of love."}, {"label": "SCIENCE", "text": "It's the first time a rocket designed by a Chinese private company has successfully entered orbit."}, {"label": "COMEDY", "text": "The special counsel investigation began one year ago on Thursday."}, {"label": "POLITICS", "text": "According to Rudy Giuliani, Trump paid Michael Cohen $420,000 – but Cohen only paid Daniels $130,000. What happened to the rest of it?"}, {"label": "ENTERTAINMENT", "text": "And it's narrated by the comedian, too."}, {"label": "EDUCATION", "text": "By David Washburn The two 9th-grade girls heard the laughing the minute they walked into their third-period class that December"}, {"label": "ENTERTAINMENT", "text": "“[People] think diversity has to do with race and gender, but there’s so much more to it.”"}, {"label": "ENTERTAINMENT", "text": "The TV reboot's hero now lives on the razor's edge."}, {"label": "POLITICS", "text": "Democrats had the power to block her nomination, but they couldn't stick together."}, {"label": "POLITICS", "text": "Opponents to the measure have vowed to challenge the ban in court."}, {"label": "ENTERTAINMENT", "text": "\"Somebody’s herrrrrrre!\""}, {"label": "SCIENCE", "text": "YIKES!"}, {"label": "POLITICS", "text": "Tony Perkins, who has warned of gay people waging an anti-Christian holocaust, is now on the Commission on International Religious Freedom."}, {"label": "COMEDY", "text": "\"I never thought I’d say this.\""}, {"label": "POLITICS", "text": "The House intelligence committee chairman, who's attacked the probe of Russian interference in the 2016 election, says he's \"standing strong\" with Trump."}, {"label": "POLITICS", "text": "\"You must show compassion and humanity,\" Vicente Fox admonished after Trump called immigrants \"animals.\""}, {"label": "MEDIA", "text": "Suzanne Scott, a Fox News lifer, has been accused of helping foster a toxic workplace for women at the cable network."}, {"label": "IMPACT", "text": "This camp in southern Spain is finding ways to restore degraded land."}, {"label": "LATINO VOICES", "text": "The coffee giant tried to apologize with a $50 gift card -- which was refused."}, {"label": "COMEDY", "text": "Pete Davidson said the future president answered a phone that didn't ring."}, {"label": "COMEDY", "text": "The \"Jimmy Kimmel Live\" host offers a rare mea culpa to the president."}, {"label": "COMEDY", "text": "“Are you looking to spend $100,000 you don’t have to get a degree that won’t help you find a job?”"}, {"label": "ENTERTAINMENT", "text": "“Maybe a lot of daughters wouldn’t react the same way, but I know the struggles he’s had these last few years.\""}, {"label": "ENTERTAINMENT", "text": "A “Solo” writer opened up about Lando Calrissian’s fluid sexuality and his desire for “a more explicitly LGBT character.”"}, {"label": "ENTERTAINMENT", "text": "How far-fetched are the racy bits in medical dramas? Some real-life doctors and nurses educate us."}, {"label": "ENTERTAINMENT", "text": "\"Can you imagine having a worse wedding?\""}, {"label": "ENTERTAINMENT", "text": "“I’ve got two words that I want you all to remember ... I'm Batman.\""}, {"label": "BLACK VOICES", "text": "Black people in America have had to justify our existence in places we’ve had the right to be simply because others rejected us."}, {"label": "BLACK VOICES", "text": "The 16 French actresses recently collaborated on a book titled “Black Is Not My Job.”"}, {"label": "BLACK VOICES", "text": "\"It's so funny to everybody because it couldn't be further from the truth,\" the actor said. \"My dad and my mom both said, 'If they only knew.'"}, {"label": "POLITICS", "text": "The scam allegedly raised $23 million from donors from 2014 to 2017."}, {"label": "ENTERTAINMENT", "text": "“We take these allegations very seriously,” an MTV spokesperson  said."}, {"label": "POLITICS", "text": "The president often talks about criminals that his administration finds and deports. But a lot of noncriminals are being swept up too."}, {"label": "POLITICS", "text": "Stone is President Donald Trump's longtime friend and former campaign consultant."}, {"label": "ENTERTAINMENT", "text": "The revelation in \"Whitney\" adds another sad chapter to the late singer's turbulent life."}, {"label": "ENTERTAINMENT", "text": "The comedian elaborates on an existing theory."}, {"label": "POLITICS", "text": "The 26-year-old's plea comes amid rioting at the prison where he has been held without trial since 2016."}, {"label": "POLITICS", "text": "\"Dear sir: THESE are animals.\""}, {"label": "ENTERTAINMENT", "text": "They're back (alright!) even though they never really left."}, {"label": "QUEER VOICES", "text": "Daniel Haack's picture book is the first release in a major GLAAD effort for kids."}, {"label": "QUEER VOICES", "text": "Alex Cooper says she endured \"physical pain and emotional pain\" during her ordeal."}, {"label": "ENTERTAINMENT", "text": "Kate McKinnon, Issa Rae and Sarah Silverman make this \"hands down\" the best cover ever."}, {"label": "POLITICS", "text": "Giuliani provided a circuitous explanation of why Trump couldn't have colluded with the Russians."}, {"label": "POLITICS", "text": "\"Does N E 1 C A train?\" reads one of the subway-themed campaign ads."}, {"label": "POLITICS", "text": "An amendment threatens farm animal protections, food safety laws and rules on invasive species."}, {"label": "POLITICS", "text": "“Essentially, barring a surprise, there is no new information that’s going to be submitted,” an agency official said."}, {"label": "POLITICS", "text": "The whistleblower said two files about Cohen's business dealings are missing from a government database."}, {"label": "WEIRD NEWS", "text": "The suspect allegedly sent a ransom photo of the victim with a live reptile on his back."}, {"label": "WOMEN", "text": "The appointments of former pageant winners follow male board members abruptly resigning in December."}, {"label": "WORLD NEWS", "text": "Pyongyang condemned recent joint military exercises conducted by the United States and South Korea, calling the drills an \"intentional provocation.\""}, {"label": "WORLD NEWS", "text": "The attack in February left 11 people in need of emergency treatment."}, {"label": "WORLD NEWS", "text": "Israeli military forces killed some 60 Palestinian demonstrators on Monday."}, {"label": "WORLD NEWS", "text": "The entry, concealed by pasted brown paper, mentions \"dirty jokes,\" sex and puberty."}, {"label": "ENTERTAINMENT", "text": "The Oakland A's player patted his heart and looked skyward as he touched home plate. \"It was pure joy,\" he said later."}, {"label": "POLITICS", "text": "Haspel looks all but assured to win confirmation in a vote before the full Senate."}, {"label": "POLITICS", "text": "It looks like at least one woman will be heading to Washington from the state."}, {"label": "ENTERTAINMENT", "text": "The talk was fun while it lasted."}, {"label": "COMEDY", "text": "\"I've been watching you.\""}, {"label": "ENTERTAINMENT", "text": "He reportedly went back to keep arguing with the guard at his gated community."}, {"label": "POLITICS", "text": "This is getting very House of Cards-y."}, {"label": "POLITICS", "text": "U.S. lawmakers demand details from Novartis and AT&T about their payments to Cohen's firm."}, {"label": "TECH", "text": "Two women decided it was time to have one."}, {"label": "POLITICS", "text": "“I don’t see how getting rid of the top cyber official in the White House does anything to make our country safer from cyber threats,” Mark Warner, the top Democrat on the Senate Intelligence committee, said."}, {"label": "POLITICS", "text": "Susan Wild would be the first woman to represent the Lehigh Valley in Congress."}, {"label": "ENTERTAINMENT", "text": "\"He was like a kid in a candy store,\" \"Robin\" author Dave Itzkoff told Jimmy Fallon."}, {"label": "POLITICS", "text": "The House minority leader is turning up in GOP attack ads for Senate and state legislative races."}, {"label": "POLITICS", "text": "This article originally appeared at TomDispatch.com. To receive TomDispatch in your inbox three times a week, click here"}, {"label": "POLITICS", "text": "Giuliani may also be trying to \"aggrandize himself,\" Jay Goldberg said."}, {"label": "BLACK VOICES", "text": "The \"Wild Thoughts\" artist received six nominations."}, {"label": "QUEER VOICES", "text": "The news comes just one year after Lebanon's first pride celebration."}, {"label": "CRIME", "text": "“The dual mission of the Manhattan D.A.’s Office is a safer New York and a more equal justice system,” said District Attorney Cyrus Vance Jr."}, {"label": "WOMEN", "text": "In the event of future lawsuits, $75 million will be set aside."}, {"label": "POLITICS", "text": "Senate transcripts reveal the president's son only partly backed White House claims that the president didn't know."}, {"label": "ENTERTAINMENT", "text": "An action-packed preview for \"Mission: Impossible -- Fallout\" features the stunt that sidelined the star."}, {"label": "ENTERTAINMENT", "text": "The Aerosmith frontman, who recently turned 70, is ready for the next big thing."}, {"label": "POLITICS", "text": "The measure’s passage is a significant victory for voting rights advocates."}, {"label": "BLACK VOICES", "text": "Look closely and you'll see some stunning details."}, {"label": "POLITICS", "text": "A reason for the payment was not specified in the financial disclosure, which has caused concern over its timing."}, {"label": "POLITICS", "text": "Advocates for Ahmed Etiwy said the White House had never made the case a priority despite President Donald Trump's \"America First\" policy."}, {"label": "MEDIA", "text": "A New York Times report detailed the agreement the network reached with multiple plaintiffs, including anchor Kelly Wright."}, {"label": "POLITICS", "text": "\"Seriously? You're pushing raffle tickets to get a picture with an elected official?\""}, {"label": "TECH", "text": "Facebook's first community standards enforcement report shows the company is \"trying to be as open as we can,” an executive said."}, {"label": "ENTERTAINMENT", "text": "“I’ve earned every f**king minute of my 38 years.”"}, {"label": "POLITICS", "text": "“When the government uses 20th-century tools to tackle 21st-century problems, it’s the public that pays the price.\""}, {"label": "ENTERTAINMENT", "text": "\"Take Me to the World\" showcases Foster's latest role as a new mom."}, {"label": "POLITICS", "text": "The EPA chief's ego and lavish spending have made him and the agency “a laughingstock,\" said Sen. Patrick Leahy (D-Vt.)."}, {"label": "POLITICS", "text": "Paulette Jordan won the Democratic primary in the Idaho governor's race."}, {"label": "POLITICS", "text": "Kara Eastman prevailed against an establishment favorite in challenging territory."}, {"label": "COMEDY", "text": "The \"Merc With A Mouth\" takes over the \"Late Show\" monologue."}, {"label": "ENTERTAINMENT", "text": "\"Deadpool 2\" stars unload on each other for laughs."}, {"label": "BLACK VOICES", "text": "The \"Brooklyn Nine-Nine\" star recalled his childhood terrors in an emotional speech."}, {"label": "POLITICS", "text": "“We’re seeing a resegregation of society that’s catalyzed by algorithms,” Wylie said Wednesday."}, {"label": "POLITICS", "text": "Many local food and beverage merchants are already on board."}, {"label": "ENTERTAINMENT", "text": "Sure, he's stayin' alive with 50 Cent rapping, but one outlet called his moves \"classic dad bopping.\""}, {"label": "POLITICS", "text": "Among the information released was an interview with Donald Trump, Jr."}, {"label": "POLITICS", "text": "The Agriculture Department found animal welfare violations in Democrat Shri Thanedar’s chemical testing facility."}, {"label": "POLITICS", "text": "But they might be overestimating what their legislation would do."}, {"label": "ENTERTAINMENT", "text": "Thirty-five years ago today, Michael Jackson took the stage and made an indelible impact on pop culture with his solo performance"}, {"label": "ENTERTAINMENT", "text": "What nightmares are made of."}, {"label": "ENTERTAINMENT", "text": "\"When democracy is dead we’ll give you a seat at the grown-up’s table.\""}, {"label": "POLITICS", "text": "The Office of Government Ethics said the president should have disclosed he repaid his lawyer for the $130,000 in hush money."}, {"label": "QUEER VOICES", "text": "Writer-producer Bryan Fuller accused the filmmakers of \"hetwashing\" their legendary subject."}, {"label": "ENTERTAINMENT", "text": "No one has ever been happier to take the subway -- in an all-white suit."}, {"label": "ENTERTAINMENT", "text": "The \"NCIS\" actress said earlier that a publicity \"machine\" was keeping her silent about the assaults."}, {"label": "POLITICS", "text": "The president also asked the attorney general to charge the mayor of Oakland with obstruction of justice for warning residents about planned immigration arrests."}, {"label": "LATINO VOICES", "text": "The man tells an employee “Your staff is speaking Spanish to customers when they should be speaking English.”"}, {"label": "POLITICS", "text": "Burn."}, {"label": "POLITICS", "text": "Experts say the choice to lead the Pension Benefit Guaranty Corp. wasn't based on qualifications."}, {"label": "POLITICS", "text": "The government suspects that Joshua Adam Schulte gave documents to WikiLeaks, but they're holding him on child pornography charges."}, {"label": "POLITICS", "text": "\"They have made a political decision. And they have every right to do that because they won the election,” Thomas Brunell said."}, {"label": "POLITICS", "text": "Thousands of pages of transcripts detail the meeting at Trump Tower with Russians."}, {"label": "COMEDY", "text": "“The president does not have a lot of respect for people whose sole job is to carry out the law.\""}, {"label": "ENTERTAINMENT", "text": "Keeping up with the Kardashians is an obvious requirement."}, {"label": "ENTERTAINMENT", "text": "It's an emotional support dinosaur."}, {"label": "ENTERTAINMENT", "text": "Here are the shows you wouldn't have known were debuting if you'd only read Netflix's monthly list."}, {"label": "POLITICS", "text": "Gee, wonder who he's talking about."}, {"label": "POLITICS", "text": "It's only a temporary victory, however."}, {"label": "CRIME", "text": "“That’s my self-torture, I guess you could say. Yes, she was victimized. Yes, I was victimized, to myself.”"}, {"label": "CRIME", "text": "\"It's clearly despicable,\" said an attorney for the girl's family."}, {"label": "WEIRD NEWS", "text": "*Drumroll*"}, {"label": "WORLD NEWS", "text": "Sadr has led two uprisings against U.S. forces in Iraq and is one of the few Shi’ite leaders to distance himself from Iran."}, {"label": "WORLD NEWS", "text": "Sixty people were killed during Monday's clashes, which took place during the opening of the U.S. embassy in Jerusalem."}, {"label": "WORLD NEWS", "text": "A cockpit windshield detached at 32,000 feet. \"The next thing I know, my co-pilot had been sucked halfway out of the window.”"}, {"label": "POLITICS", "text": "\"Tariffs are B-A-D,\" says a deadpan Ben Stein in front of a chalkboard."}, {"label": "POLITICS", "text": "“More voter participation makes for a stronger democracy,\" Gov. Jay Inslee said."}, {"label": "POLITICS", "text": "Everyone agrees that the national discourse is currently less than genteel -- and that the other side is to blame."}, {"label": "POLITICS", "text": "News of the investigation comes two months after the company was accused of harvesting 87 million Facebook users’ personal data."}, {"label": "QUEER VOICES", "text": "\"It’s about how you want to make change and what you to change.\""}, {"label": "POLITICS", "text": "Israeli forces opened fire on Palestinian protesters on Monday, killing more than 50 and injuring thousands more."}, {"label": "POLITICS", "text": "She repeatedly refused to weigh in on its morality at her confirmation hearing."}, {"label": "TECH", "text": "Tesla CEO Elon Musk tweeted that it's amazing the driver wasn't more seriously injured."}, {"label": "POLITICS", "text": "After the nuclear deal, Iran hoped to replace more than 200 of its planes. It has only received 11."}, {"label": "POLITICS", "text": "At an event attended by officers' families, the president denounced MS-13 and called for the death penalty for those who kill police officers."}, {"label": "POLITICS", "text": "The Missouri governor’s lawyers accuse St. Louis Circuit Attorney Kim Gardner of misconduct in the felony case."}, {"label": "POLITICS", "text": "The Massachusetts senator announced a $175,000 contribution to state legislature campaigns and gerrymandering reform groups."}, {"label": "QUEER VOICES", "text": "A growing number of states have adopted similar legislation to protect LGBTQ youth."}, {"label": "MEDIA", "text": "“Bob Mueller has no duty to tip his hand and show his cards until the end of his investigation,\" Andrew Napolitano said."}, {"label": "COMEDY", "text": "\"Sean, what are you wearing?\""}, {"label": "ENTERTAINMENT", "text": "Mamma mia!"}, {"label": "COMEDY", "text": "\"Trump didn’t drain the swamp. He bottled it and sold it as Dr. Trump’s Miracle Healing Elixir.\""}, {"label": "ENTERTAINMENT", "text": "\"The venom of greed is killing America.\""}, {"label": "POLITICS", "text": "The EPA had justified Pruitt's expensive security as a response to threats. New emails appear to cast further doubt on the claim."}, {"label": "POLITICS", "text": "Conspiracy theorist John Guandolo, who says Islam is \"barbaric and evil,\" conducted a state-approved training session this month."}, {"label": "ENTERTAINMENT", "text": "Khloé Kardashian is opening up about why she decided to name her daughter True. The “Keeping Up With the Kardashians” star"}, {"label": "POLITICS", "text": "Democrats have lost the debate over torture after two Democratic senators said they plan to back Haspel's confirmation."}, {"label": "BLACK VOICES", "text": "“It was just the worst month of my life.”"}, {"label": "ENTERTAINMENT", "text": "Sandra Bullock apparently wanted her to dial it down."}, {"label": "POLITICS", "text": "The former representative from Texas says he's balking on the advice of his lawyer."}, {"label": "BLACK VOICES", "text": "A 10-minute ovation and Lee’s takedown of the \"motherf**ker\" president made it a festival day to remember."}, {"label": "COMEDY", "text": "\"According to my latest science, there is space.\""}, {"label": "POLITICS", "text": "\"Daddy's Little Diplomat\" gets called out over Israel trip."}, {"label": "QUEER VOICES", "text": "The skater impressed with an emotional contemporary routine set to a familiar song."}, {"label": "POLITICS", "text": "The former Fox News host ignored the lesson that immigrants, past and present, are alike -- including the ones in her own family."}, {"label": "POLITICS", "text": "\"We’re going to put them on this bus and send them home,\" boasts state Sen. Michael Williams."}, {"label": "MEDIA", "text": "The tabloid said the first daughter was \"all smiles\" as protesters died in Gaza."}, {"label": "BLACK VOICES", "text": "The officers who took Robinson into custody have been reassigned pending an investigation."}, {"label": "COMEDY", "text": "The \"Late Show\" host took aim at Ivanka Trump and Jared Kushner's presence in Jerusalem."}, {"label": "COMEDY", "text": "\"I think you meant to say, By 35 you should have debt twice your salary.\""}, {"label": "BLACK VOICES", "text": "Google's Annie Jean-Baptiste says diversity should be \"core to how everyone does business, not just a 'nice to have.'\""}, {"label": "ENTERTAINMENT", "text": "“Now America has to get rid of him. Don’t say I didn’t warn you!”"}, {"label": "ENTERTAINMENT", "text": "The feud between Wayans and his fired \"Lethal Weapon\" co-star just got real public."}, {"label": "ENTERTAINMENT", "text": "Ron Howard's drama-addled spinoff doesn't get Han quite right, but the movie is entertaining in a witless way."}, {"label": "ENTERTAINMENT", "text": "CBS confirmed that Perrette \"came to us with a workplace concern.\""}, {"label": "ENTERTAINMENT", "text": "\"It was totally bizarre and such a gamble.\""}, {"label": "COMEDY", "text": "\"I encourage my audience to not watch Fox News.\""}, {"label": "BUSINESS", "text": "Following the council vote, Amazon’s vice president, Drew Herdener, said the company has resumed construction planning for its so-called Block 18 project in downtown Seattle."}, {"label": "BUSINESS", "text": "Victims will be free to go to court -- but a few caveats remain."}, {"label": "BLACK VOICES", "text": "“People still have their own opinions of me attending Spelman, but it’s because of Spelman why I am who I am.”"}, {"label": "ENTERTAINMENT", "text": "Or both, if you're \"Brooklyn Nine-Nine.\""}, {"label": "RELIGION", "text": "Trenton McKinley is recovering from severe brain trauma after an accident."}, {"label": "ENTERTAINMENT", "text": "The singer said she \"lost my sanity\" after the success of her single \"Whip My Hair\" in 2010."}, {"label": "IMPACT", "text": "But not everyone is on board."}, {"label": "WOMEN", "text": "Going, going, gone."}, {"label": "ENTERTAINMENT", "text": "Did aliens really influence fashion choices in \"The X-Files\" universe?"}, {"label": "POLITICS", "text": "The state attorney general has five days to file an emergency appeal challenging the ruling."}, {"label": "POLITICS", "text": "The gun group has worked to \"perpetuate the culture of violence that we have in our country,\" the congresswoman said."}, {"label": "QUEER VOICES", "text": "The rapper wrote on Twitter that she thought \"the song was a good song.\""}, {"label": "TRAVEL", "text": "The airline released a list of prohibited animals after seeing a 40 percent rise in onboard companions."}, {"label": "WEIRD NEWS", "text": "The voice is creating division on the internet not seen since that infamous dress."}, {"label": "WORLD NEWS", "text": "A plastic bag was found at a depth of almost 36,000 feet in the Mariana Trench. Scientists say it's the world's deepest known piece of plastic trash."}, {"label": "WORLD NEWS", "text": "Major powers worry that the U.S. move could inflame Palestinian unrest in the occupied West Bank and on the Gaza Strip border."}, {"label": "WORLD NEWS", "text": "In Gaza, Palestinian protests quickly turned into bloodshed."}, {"label": "TECH", "text": "The investigation was launched in response to the Cambridge Analytica scandal."}, {"label": "POLITICS", "text": "Reid underwent surgery Monday to remove a tumor, according to his family."}, {"label": "POLITICS", "text": "Rohit Chopra, a Trump appointee to the Federal Trade Commission, took a not-so-subtle jab at the tech giant."}, {"label": "POLITICS", "text": "The White House appeared to be more upset that Kelly Sadler’s comment was leaked than by her ugly remark."}, {"label": "POLITICS", "text": "State Sen. Neal Tapio was the state director for Donald Trump’s 2016 campaign."}, {"label": "BLACK VOICES", "text": "The director said the \"Black Panther\" women may be \"more important\" than the male characters."}, {"label": "RELIGION", "text": "The man turns to the counter and the server appears to ask him to leave. A male voice can be heard in the background yelling"}, {"label": "POLITICS", "text": "The ruling paves the way for states to legalize sports betting, but could have implications far beyond sports."}, {"label": "MEDIA", "text": "Who's falling in line for Fox News?"}, {"label": "ENTERTAINMENT", "text": "Surprise! Netflix adds a pretty good sci-fi movie."}, {"label": "POLITICS", "text": "St. Louis Circuit Attorney Kim Gardner took the action after the defense requested to put her on the stand."}, {"label": "SPORTS", "text": "Beitar Jerusalem said it's making the move to honor the U.S. embassy's relocation."}, {"label": "POLITICS", "text": "\"In a time where LBGTQIA rights are being rolled back on the federal level, when the Trump administration isn't protecting children, it is our duty to step in.\""}, {"label": "QUEER VOICES", "text": "The pop star's new song was called out for exploiting bisexuality."}, {"label": "POLITICS", "text": "In one of his most controversial decisions to date, Trump declared Jerusalem the capital of Israel in December."}, {"label": "COMEDY", "text": "Ouch!"}, {"label": "ENTERTAINMENT", "text": "He’s missing his sideburns, iconic mustache and eyebrows."}, {"label": "ENTERTAINMENT", "text": "From #CoupleGoals to #ExGoals."}, {"label": "ENTERTAINMENT", "text": "The actor claims a woman \"started kissing\" him without asking in public."}, {"label": "ENTERTAINMENT", "text": "Actresses Teri Hatcher and Erica Durance remembered Kidder on social media."}, {"label": "POLITICS", "text": "It's only been a month since he quit his House seat amid an ethics committee probe into sexual harassment allegations."}, {"label": "POLITICS", "text": "“We are No. 1 in the country when it comes to protecting life,” Republican Gov. Kim Reynolds said."}, {"label": "WOMEN", "text": "In the Cannes festival's seven decades, only 82 movies directed by women have competed in the main slate, compared with 1,645 directed by men."}, {"label": "BLACK VOICES", "text": "Just a week after its release, it's already his biggest hit ever."}, {"label": "ENTERTAINMENT", "text": "The two comic legends are joining forces for a limited tour in June."}, {"label": "SPORTS", "text": "Raquel Pennington took even more of a beating in a bloody loss to champion Amanda Nunes."}, {"label": "POLITICS", "text": "Her condition was benign, her office said, but she will remain hospitalized this week."}, {"label": "POLITICS", "text": "The Montanan is up for re-election in a state Trump won in a romp. That hasn't stopped him from opposing Trump nominees."}, {"label": "ENTERTAINMENT", "text": "The “Empire” star’s NFL boo took a knee and popped the question. 💕"}, {"label": "BLACK VOICES", "text": "The shop on Duke University's campus apologized for booting the workers and said it's cutting ties with the school."}, {"label": "QUEER VOICES", "text": "In 2017, Robert Tennent experienced a sexual assault that led to a period of celibacy. During that time, he attended counseling to be able to introduce sex to his life again."}, {"label": "POLITICS", "text": "Now Rudy Giuliani's spilling the beans on the president's diet efforts, too."}, {"label": "POLITICS", "text": "\"Warning ignored. So here it goes,\"  Stormy Daniels' attorney tweeted."}, {"label": "POLITICS", "text": "As one paraphrased Trump, “the food here is awful and the portions are too small.”"}, {"label": "POLITICS", "text": "Trump will profit from Indonesian resort project that will get $500 million in Chinese loans in a deal sealed days before before his tweet ordering help for ZTE."}, {"label": "POLITICS", "text": "The movement demands lawmakers do more to help Americans in poverty, from supporting a $15 minimum wage to ending systemic racism."}, {"label": "ENTERTAINMENT", "text": "Her answer is better than just a “yes” or “no.”"}, {"label": "ENTERTAINMENT", "text": "I think? I'm so confused."}, {"label": "ENTERTAINMENT", "text": "Actors Jimmi Simpson and Clifton Collins Jr. say Season 2 is just getting started."}, {"label": "ENTERTAINMENT", "text": "The cause of death has not been made public."}, {"label": "POLITICS", "text": "Lahren’s great-great-grandmother spoke no English after living in the United States for a decade."}, {"label": "ENTERTAINMENT", "text": "A meeting of the Hans."}, {"label": "ENTERTAINMENT", "text": "Cease and desist, social media sleuths."}, {"label": "ENTERTAINMENT", "text": "Stifler to the rescue."}, {"label": "ENTERTAINMENT", "text": "A conversation with the comedy mastermind about playing Jared, the heart of the HBO tech satire's fifth season."}, {"label": "ENTERTAINMENT", "text": "Oh, and he sang “Tomorrow” from the musical “Annie.”🦄🌈🎤"}, {"label": "ENTERTAINMENT", "text": "\"This one goes out to anyone having a less than perfect Mother's Day today.\""}, {"label": "ENTERTAINMENT", "text": "The young aspiring singer was given the opportunity and she crushed it."}, {"label": "POLITICS", "text": "Another evangelical Christian leader speaking at the opening of the new American embassy once said Hitler was a \"hunter\" helping Jews return to Israel."}, {"label": "BUSINESS", "text": "The breach is believed to have occurred between March and April."}, {"label": "POLITICS", "text": "Trump applauded Shaw for his “heroic actions,” in a phone call Monday, according to the White House."}, {"label": "MEDIA", "text": "Jeanine Pirro also compared Trump to King Cyrus."}, {"label": "TECH", "text": "Drivers have succumbed to carbon monoxide poisoning after forgetting to turn off a vehicle in their garage."}, {"label": "WEIRD NEWS", "text": "“We can’t even estimate the rarity of this,\" one scientist said."}, {"label": "WORLD NEWS", "text": "Suicide bombers attacked three churches in Surabaya, Indonesia's second-largest city, on Sunday morning."}, {"label": "WORLD NEWS", "text": "The U.S. withdrawal from the accord was a “violation of morals,” Iranian President Hassan Rouhani said."}, {"label": "POLITICS", "text": "“I think most Americans would like to see the Trump administration do better in situations like this.”"}, {"label": "COMEDY", "text": "And she disses husband Chris Fischer's marriage proposal."}, {"label": "POLITICS", "text": "Much of the U.S. public appears not to have any deeply held convictions about the accord."}, {"label": "POLITICS", "text": "The gathering boasted record attendance amid the rise of a newly vocal gun-control movement."}, {"label": "TECH", "text": "It's not yet known if the autopilot was engaged. The car's driver suffered a broken ankle."}, {"label": "POLITICS", "text": "\"How did we go from a president who could not tell a lie to politicians who cannot tell the truth?\""}, {"label": "BLACK VOICES", "text": "“How Black Oakland responds to a white lady calling the cops on Black folks BBQing.\""}, {"label": "ENTERTAINMENT", "text": "Who doesn't want Melissa McCarthy to be their stepmom?"}, {"label": "COMEDY", "text": "\"Oh my God, this so could be me and my friends. You know, with the way things are going.\""}, {"label": "BLACK VOICES", "text": "“I can’t breathe,” the young man yells as security guards appear to hold him down by the neck."}, {"label": "POLITICS", "text": "“So much of what I’ve done and so much of what I’ve become is because of my mother. I miss her a lot,” he said."}, {"label": "POLITICS", "text": "ZTE pleaded guilty last year to conspiring to violate U.S. sanctions by illegally shipping U.S. goods and technology to Iran."}, {"label": "POLITICS", "text": "And they leaked that too."}, {"label": "POLITICS", "text": "\"We’re not criminal civil terrorists,\" Fred Guttenberg responded to North. \"We're people with a broken heart.\""}, {"label": "POLITICS", "text": "The national security adviser believes the U.S. can force European nations to abandon the historic Iran nuclear accord."}, {"label": "POLITICS", "text": "Little Michelle!"}, {"label": "POLITICS", "text": "The Fox News pundit gave a dubious history lesson to defend White House chief of staff John Kelly."}, {"label": "WORLD NEWS", "text": "\"These people were incredibly lucky,\" says a park spokesman."}, {"label": "WORLD NEWS", "text": "Time to join the resistance, German newsmagazine says, \"against America.\""}, {"label": "WORLD NEWS", "text": "It could pave the way for the 81-year-old to run for prime minister in the next national election."}, {"label": "WORLD NEWS", "text": "President Donald Trump plans to hold a summit with North Korean leader Kim Jong Un on June 12."}, {"label": "WORLD NEWS", "text": "The Islamic State claimed responsibility."}, {"label": "ENTERTAINMENT", "text": "The movie most worth watching has a lot to say about the times we live in."}, {"label": "ENTERTAINMENT", "text": "The one movie worth seeing stars Salma Hayek."}, {"label": "COMEDY", "text": "Happy MAGA's Day!"}, {"label": "ENTERTAINMENT", "text": "Fox canceled the hit comedy on Thursday."}, {"label": "ENTERTAINMENT", "text": "It involves unpaid taxes, the IRS and a drunk Quincy Jones."}, {"label": "QUEER VOICES", "text": "Multiple equal rights groups are already considering legal action."}, {"label": "POLITICS", "text": "The special counsel is looking at contributors tied to Russia, Qatar, Saudi Arabia and United Arab Emirates, ABC News says."}, {"label": "COMEDY", "text": "The comedian has a workaround."}, {"label": "TECH", "text": "Super cool, or bone chilling?"}, {"label": "WOMEN", "text": "Paige Patterson's remarks about women and abuse have been causing division in Southern Baptist circles."}, {"label": "POLITICS", "text": "If they succeed, the liberal billionaire and political action committees could change how the law is enforced in America."}, {"label": "IMPACT", "text": "A photographer visited some of the planet's most pristine places to capture images of the natural world."}, {"label": "ENTERTAINMENT", "text": "The Russo brothers confirm who's safe and who bit the dust."}, {"label": "BUSINESS", "text": "Just by using the app, you click away your rights. Now some victims are fighting for change."}, {"label": "ENTERTAINMENT", "text": "The collaboration leaned heavily on artists and writers from China."}, {"label": "ENTERTAINMENT", "text": "The unaired clip may bring tears to your eyes."}, {"label": "COMEDY", "text": "“People call this presidency a ‘reality show.' It's more like a Scorsese movie.\""}, {"label": "BUSINESS", "text": "The city wants to tax large corporations to pay for homeless housing, but Jeff Bezos isn't pleased."}, {"label": "ENTERTAINMENT", "text": "\"They'll see and they'll know...\""}, {"label": "BLACK VOICES", "text": "The “Black Panther” star also shared how his time as a Howard student prepared him for challenges he faced early in his career."}, {"label": "POLITICS", "text": "Erik's radicalization shows that the incel phenomenon has nothing to do with sex — duh — and everything with entitlement."}, {"label": "POLITICS", "text": "The military is diverse, but you wouldn't know it from this White House event honoring service moms and spouses."}, {"label": "ENTERTAINMENT", "text": "\"Oh no, you’ve just lost.\""}, {"label": "WOMEN", "text": "“Women are not a minority in the world, yet the current state of the industry says otherwise,” said Cate Blanchett."}, {"label": "QUEER VOICES", "text": "A bystander was also beaten bloody in the attack, which was caught on camera."}, {"label": "QUEER VOICES", "text": "An inmate’s sex assigned at birth will now be used to make the initial decision as to where transgender prisoners are housed."}, {"label": "POLITICS", "text": "The telecommunications giant's $85 billion merger is currently pending approval from the Justice Department."}, {"label": "POLITICS", "text": "At least 16 state lawmakers have resigned or been expelled from their legislatures since the #MeToo movement started seven"}, {"label": "POLITICS", "text": "The sponsor of the measure says the city should not be contributing to gun violence in any way."}, {"label": "ENTERTAINMENT", "text": "Someone has to get these movies ready for TV."}, {"label": "POLITICS", "text": "“It wasn’t a mistake,\" Sen. Jeff Merkley said."}, {"label": "ENTERTAINMENT", "text": "Glover plays the iconic \"Star Wars\" character Lando Calrissian."}, {"label": "COMEDY", "text": "\"But this is still the same guy who wanted to ban Muslims.\""}, {"label": "POLITICS", "text": "\"Be Best,\" Mr. President."}, {"label": "ENTERTAINMENT", "text": "Damn! A preview for the rejected TV series looks like scary fun."}, {"label": "ENTERTAINMENT", "text": "The frontman's body was found in Scotland a day after he was reported missing."}, {"label": "CRIME", "text": "The victim is in stable condition after being shot in the arm."}, {"label": "COMEDY", "text": "Here's the reason Michael Cohen didn't get a gig inside 1600 Pennsylvania Ave."}, {"label": "COMEDY", "text": "He also likened Trump's personal attorney to a Nigerian Prince scam artist."}, {"label": "BLACK VOICES", "text": "“Y’all both black so y’all both can’t afford to fail.\""}, {"label": "QUEER VOICES", "text": "Meet Angel, played by transgender actress Indya Moore."}, {"label": "CRIME", "text": "Joseph James DeAngelo has now been charged in a dozen homicides."}, {"label": "COMEDY", "text": "This deserves an award of its own."}, {"label": "POLITICS", "text": "Sen. John McCain (R-Ariz.) reportedly wishes he'd chosen Joe Lieberman as his 2008 running mate."}, {"label": "CRIME", "text": "“I can only describe it as a horrific situation,” a police commissioner said."}, {"label": "ENTERTAINMENT", "text": "The funny trailer featuring Ryan Reynolds and the soccer great gets fans laughing before superhero sequel's opening."}, {"label": "COMEDY", "text": "He's here to make a \"strong case\" for the president."}, {"label": "WEIRD NEWS", "text": "The 25 most profound “Shower Thoughts” on Reddit from the last week."}, {"label": "POLITICS", "text": "The aide reportedly tossed out the cruel remark in response to the senator's opposition to the CIA director nominee."}, {"label": "QUEER VOICES", "text": "the end result — “Cher: The Unauthorized Rusical” – still needs to go straight to Broadway and win all the Tonys."}, {"label": "POLITICS", "text": "One scientist calls the decision to cancel the program a \"grave mistake.\""}, {"label": "CRIME", "text": "Michigan cops say Arthur Ream bragged \"about murdering four to six people.\""}, {"label": "QUEER VOICES", "text": "The “Glee” star said “people knew” he was gay before his viral Ariana Grande tweet."}, {"label": "POLITICS", "text": "“This is a race that people around the country should probably be watching closely,” one strategist said."}, {"label": "POLITICS", "text": "Investigators traced IP addresses linked to the attack to foreign countries."}, {"label": "QUEER VOICES", "text": "Parents complained, with one saying she was promoting “the LGBTQ agenda.”"}, {"label": "QUEER VOICES", "text": "The district faces a hearing to determine if the district complied with state anti-discrimination laws."}, {"label": "POLITICS", "text": "Apparently, it's that time of year already."}, {"label": "ENTERTAINMENT", "text": "She stars as an alien in 1970s England alongside Alex Sharp and Nicole Kidman."}, {"label": "POLITICS", "text": "\"No one calls him 'Songbird John' except for crazy people and jerks — and I’m using my language carefully here,” Tapper said."}, {"label": "MEDIA", "text": "Tom McInerney previously has promoted the birther conspiracy theory against President Barack Obama."}, {"label": "POLITICS", "text": "Immigration prosecutions are normally open-and-shut cases. But the president’s tweets are once again undermining him in court."}, {"label": "ENTERTAINMENT", "text": "Easy on the emojis!"}, {"label": "ENTERTAINMENT", "text": "\"I can’t tell if that’s a compliment or not.\""}, {"label": "BLACK VOICES", "text": "Richard Overton, a World War II veteran, is celebrating his 112th birthday."}, {"label": "POLITICS", "text": "\"You're a disgrace. Apologize to the entire McCain family, then resign.\""}, {"label": "ENTERTAINMENT", "text": "Don't be surprised if more dogs are named Bark Hamill."}, {"label": "POLITICS", "text": "The EPA knew Vatican treasurer George Pell was under investigation, but went ahead with the dinner during Pruitt's trip to Italy."}, {"label": "POLITICS", "text": "“It doesn’t matter. He’s dying anyway,” Kelly Sadler said of Sen. John McCain, who is at odds with the president over his CIA nominee."}, {"label": "BLACK VOICES", "text": "Too often white people call the police on people of color when it is unwarranted ― and such calls can end in undue violence."}, {"label": "BLACK VOICES", "text": "Their crime? Using the wrong type of grill in a barbecue-designated zone."}, {"label": "ENTERTAINMENT", "text": "Some say he has the success of \"Roseanne\" to thank."}, {"label": "POLITICS", "text": "\"People have wondered when decency would hit rock bottom with this administration. It happened yesterday,\" the former vice president said."}, {"label": "MEDIA", "text": "“We’ve got emails, we’ve got text messages, we’ve got other financial information.\""}, {"label": "MEDIA", "text": "Whoops."}, {"label": "POLITICS", "text": "\"Their pro-gun policies have resulted in dead children, dead mothers and dead fathers,\" says Democratic congressional candidate Pat Davis."}, {"label": "RELIGION", "text": "“Ultimately I was allowed to fly. But it was because of who I was, and that should not be the case,” said Navdeep Bains."}, {"label": "ENTERTAINMENT", "text": "Their expressions say it all."}, {"label": "WEIRD NEWS", "text": "In one text message, Jacqueline Ades allegedly told her date she'd like to bathe in his blood."}, {"label": "MEDIA", "text": "How sex-scandal lawyer Keith Davidson works the Hollywood tabloid racket and muscles journalists."}, {"label": "POLITICS", "text": "A nasty primary race has made the congressional candidate tell the difficult story of escaping her violent ex-husband."}, {"label": "POLITICS", "text": "So much for an all-out assault on Big Pharma."}, {"label": "POLITICS", "text": "The president’s new lead lawyer sees this as proof Trump is draining the swamp."}, {"label": "POLITICS", "text": "Fewer than 10 percent of the ads specifically targeted a state in contention."}, {"label": "POLITICS", "text": "Leaders of AfriForum, an Afrikaner rights group, also posed for a picture with national security adviser John Bolton."}, {"label": "TRAVEL", "text": "If you're overwhelmed, start here."}, {"label": "WEIRD NEWS", "text": "Soon we’ll have nowhere to hide."}, {"label": "WOMEN", "text": "A group of students defended the professor, writing that she was \"noting the importance of professionalism.\""}, {"label": "WOMEN", "text": "\"On a scale of Kanye to Donald Glover, how are you feeling today?\""}, {"label": "WORLD NEWS", "text": "The move comes after Israel accused Iranian forces in Syria of firing rockets into the Golan Heights."}, {"label": "WORLD NEWS", "text": "The airstrikes were in response to Iranian forces in Syria who shelled Israeli army outposts across the Syrian frontier."}, {"label": "WORLD NEWS", "text": "The Australian scientist and botanist died at an assisted-dying clinic in Switzerland."}, {"label": "WORLD NEWS", "text": "\"We thank God, and all our families and friends who prayed for us and for our return.\""}, {"label": "WORLD NEWS", "text": "The floodwaters swept away power lines, homes and buildings, including a primary school."}, {"label": "ENTERTAINMENT", "text": "It's unclear how the music streaming service's new policy on “hate content and hateful conduct\" will affect other artists' music."}, {"label": "POLITICS", "text": "The president is expected to reveal details of the meeting with the North Korean leader in three days."}, {"label": "POLITICS", "text": "The New York Times says Trump berated Kirstjen Nielsen's ability to secure the border."}, {"label": "POLITICS", "text": "\"There’s no reason to foreclose things,\" the former Planned Parenthood president told Refinery29."}, {"label": "POLITICS", "text": "Information on Kobach's website misleadingly suggests that everyone in Kansas needs to prove they're a citizen when they register to vote."}, {"label": "QUEER VOICES", "text": "The writer-producer vowed to ensure the show's inclusivity extends beyond diverse casting."}, {"label": "ENTERTAINMENT", "text": "Ooh wee!"}, {"label": "ENTERTAINMENT", "text": "Wade Wilson isn't playing."}, {"label": "CRIME", "text": "Christann Shyvin Gainey was arrested after the 84-year-old died of a head injury at a nursing home last month."}, {"label": "POLITICS", "text": "The vulnerable incumbent will criticize the GOP tax law and Mitch McConnell instead."}, {"label": "ENTERTAINMENT", "text": "The actor has kept out of the spotlight since the late ’90s."}, {"label": "POLITICS", "text": "Rep. Martha McSally of Arizona is running in a Senate primary against conservative favorites Kelli Ward and Joe Arpaio."}, {"label": "POLITICS", "text": "\"I believe the Senate should exercise its duty of advice and consent and reject this nomination,\" the Arizona Republican said."}, {"label": "WORLD NEWS", "text": "They say an investigation into the murder of the black, queer Rio city councilwoman is on the \"right path.\" It may lead back to police."}, {"label": "QUEER VOICES", "text": "Even if it’s still “difficult” for him, he doesn’t show it."}, {"label": "POLITICS", "text": "Women are running for attorney general posts all over the country."}, {"label": "RELIGION", "text": "Charles Dwight Stout III admitted to vandalizing the Islamic Center of Murfreesboro with graffiti and strips of bacon."}, {"label": "POLITICS", "text": "\"Why does Mike Pence want to kill this investigation?” asked Joe Scarborough."}, {"label": "ENTERTAINMENT", "text": "The actor speculates about an older version of his character and teases what's ahead in the romance department."}, {"label": "POLITICS", "text": "The U.S. Senate plans to vote next week on whether to reject the FCC's repeal of the Obama-era rules."}, {"label": "POLITICS", "text": "Kevin Kamenetz, 60, was a two-term Baltimore County executive, husband and father of two sons."}, {"label": "BLACK VOICES", "text": "A 22-year-old's violent arrest is once again prompting questions about the police."}, {"label": "COMEDY", "text": "\"Even in defeat, this man was TV gold.\""}, {"label": "ENTERTAINMENT", "text": "This is no laughing matter."}, {"label": "POLITICS", "text": "A pending appointment marks a truce in an ongoing saga."}, {"label": "ENTERTAINMENT", "text": "The Olympic gymnast is transformed into a middle-aged office manager."}, {"label": "CRIME", "text": "\"This is not something we commonly see,\" a cop said."}, {"label": "POLITICS", "text": "A crappy situation involving a Putin crony, Trump sanctions and the bathrooms of a government building."}, {"label": "POLITICS", "text": "“You gotta do it. I’m mean, you don’t have a choice.”"}, {"label": "MEDIA", "text": "\"That's why they call him 'Songbird John.'\""}, {"label": "ENTERTAINMENT", "text": "Redneck Margaritas all around! 💕"}, {"label": "QUEER VOICES", "text": "It's \"not only unprecedented in Pakistani history, but it's one of the most progressive laws in the whole world.\""}, {"label": "MEDIA", "text": "The CNN analyst and former CIA official also blamed Congress and the DOJ for the agency's defunct torture program."}, {"label": "POLITICS", "text": "The House released all 3,000 of the ads on Thursday."}, {"label": "ENTERTAINMENT", "text": "The reality TV star is, however, still \"rooting\" for the couple."}, {"label": "ENTERTAINMENT", "text": "At 15 years, he's the longest-running cast member."}, {"label": "ENTERTAINMENT", "text": "We'll take a full album, please."}, {"label": "POLITICS", "text": "Cheney's comments come as lawmakers have scrutinized CIA director nominee Gina Haspel for her role in overseeing the controversial program."}, {"label": "ENTERTAINMENT", "text": "The “Ladybird” director seemed to have a blast watching the Amy Schumer flick in an almost empty theater."}, {"label": "POLITICS", "text": "The Republican congressman has proposed impeaching two DOJ leaders and holding a third in contempt."}, {"label": "ENTERTAINMENT", "text": "He popped the question surrounded by his \"Queer Eye\" family."}, {"label": "TECH", "text": "If you’re on a time crunch to find a perfect Mother’s Day gift that’ll still arrive on time, it’s your lucky day. Amazon"}, {"label": "ENTERTAINMENT", "text": "Tom Hardy is an actor known for physical transformations, be it sporting tribal tattoos for FX’s “Taboo,” developing a strapping"}, {"label": "CRIME", "text": "Prominent attorney Gloria Allred is representing the unidentified plaintiff."}, {"label": "POLITICS", "text": "Ron Johnson and Mitch McConnell did whatever it took to hold the lifetime seat open for a GOP president to fill."}, {"label": "CRIME", "text": "Brandon Lecroy, 25, was indicted by a grand jury on charges of murder for hire."}, {"label": "POLITICS", "text": "Trump will meet with Kim Jong Un on June 12 in Singapore."}, {"label": "WOMEN", "text": "\"Eric Schneiderman, you are trash and we do not need you.\""}, {"label": "ENTERTAINMENT", "text": "There's even a code hidden within the painting."}, {"label": "COMEDY", "text": "\"Every single person loved it.\""}, {"label": "ENTERTAINMENT", "text": "The season finale was a shocker."}, {"label": "COMEDY", "text": "They still deserve detention."}, {"label": "COMEDY", "text": "The \"Late Show\" host runs the numbers."}, {"label": "WEIRD NEWS", "text": "Achoo!"}, {"label": "ENTERTAINMENT", "text": "So awkward ... so fun."}, {"label": "BLACK VOICES", "text": "“I pay tuition like everybody else,\" Lolade Siyonbola, an African studies graduate student, told police. \"I’m not going to justify my existence here.”"}, {"label": "POLITICS", "text": "Partners at the law firm reportedly were displeased at Giuliani's suggestion that payoffs like Michael Cohen's deal with Stormy Daniels were common practice."}, {"label": "QUEER VOICES", "text": "The singer-songwriter received much love on social media for walking the red carpet."}, {"label": "ENTERTAINMENT", "text": "The reason may sound familiar."}, {"label": "ENTERTAINMENT", "text": "Did an old interview question hint at a future Captain America-related plot twist? Maybe."}, {"label": "POLITICS", "text": "The plan's architects say they didn't mean to disadvantage black cities, but they had easy ways not to."}, {"label": "POLITICS", "text": "“Well ... the ka-kahas hit the fan now.”"}, {"label": "POLITICS", "text": "For Americans behind bars in Iran, Egypt, Turkey and elsewhere, homecoming ceremonies appear to be a long way off."}, {"label": "QUEER VOICES", "text": "The Netflix movie finds a teen caught between a girlfriend and a boy crush."}, {"label": "WEIRD NEWS", "text": "But the finder has raised questions by changing her story about where the cats came from."}, {"label": "WEIRD NEWS", "text": "\"We made a mistake.\""}, {"label": "WORLD NEWS", "text": "Trump's decision to withdraw the U.S. from the Iran nuclear deal did not receive a positive reception from Iranian lawmakers."}, {"label": "WORLD NEWS", "text": "“The deal is not dead. There’s an American withdrawal from the deal but the deal is still there.\""}, {"label": "WORLD NEWS", "text": "Secretary of State Mike Pompeo departed North Korea with the three Americans."}, {"label": "POLITICS", "text": "Ohio state Sen. Troy Balderson now will face a Democrat in an Aug. 7 special election."}, {"label": "POLITICS", "text": "WNYC has released an interview conducted last week that host Alec Baldwin says is now \"difficult listening.\""}, {"label": "COMEDY", "text": "\"I thought I had heard it all, but this guy?\""}, {"label": "POLITICS", "text": "Millions of dollars flowed into a dummy corporation used by Michael Cohen to pay for a porn star's silence."}, {"label": "POLITICS", "text": "He defeated two congressmen and will challenge Democratic Sen. Joe Donnelly in November."}, {"label": "POLITICS", "text": "The Democratic senator \"would rather give ... terrorists hugs and safe spaces than take adequate action to protect America,\" state Sen. Leah Vukmir (Wis.) said."}, {"label": "POLITICS", "text": "A mix of enforcement and assistance gets people off unemployment benefits and back to work faster, research suggests."}, {"label": "QUEER VOICES", "text": "He also opened up about his new role in \"The Boys in the Band\" on Broadway."}, {"label": "POLITICS", "text": "Rachel Crooks says Trump forcibly kissed her in the Trump Tower lobby in 2005."}, {"label": "POLITICS", "text": "Khalid Sheikh Mohammed is seeking permission to provide information to senators about the controversial CIA director nominee."}, {"label": "POLITICS", "text": "Sen. Joe Manchin of West Virginia has voted with Trump 61 percent of the time."}, {"label": "ENTERTAINMENT", "text": "The shade was real at the opening night of her \"Reputation\" tour."}, {"label": "ENTERTAINMENT", "text": "Congrats, Kim!"}, {"label": "ENTERTAINMENT", "text": "The company says NBC leaders didn't know about their star anchor's misconduct."}, {"label": "POLITICS", "text": "Though hackers had access to voter registration data, they did not appear to be able to change individual votes or vote totals."}, {"label": "POLITICS", "text": "Democrat Richard Cordray will face Republican Mike DeWine in November."}, {"label": "BLACK VOICES", "text": "Video captured him shooting at the feet of a black counterprotester."}, {"label": "POLITICS", "text": "Demonstrators gathered inside and outside the building for the CIA nominee's confirmation hearing."}, {"label": "POLITICS", "text": "The arrangement illustrates efforts by the telecom to work with an influential adviser to the new president as his administration took up major industry issues."}, {"label": "POLITICS", "text": "\"Does the back say 'Turning back a century on women's rights!'?\""}, {"label": "POLITICS", "text": "\"For the first time in 8 years I feel like dancing.\""}, {"label": "COMEDY", "text": "“You literally just backed out of an American promise.\""}, {"label": "POLITICS", "text": "Richard Grenell, a Trump ally and former Fox News commentator, has a history of stirring controversy on social media."}, {"label": "ENTERTAINMENT", "text": "The film \"Us\" will hit theaters next March."}, {"label": "ENTERTAINMENT", "text": "They even sang some of the Spice Girls' best hits."}, {"label": "COMEDY", "text": "The former New York mayor probably won't like this definition."}, {"label": "QUEER VOICES", "text": "A temporary monument to the victims of the 2016 mass shooting was unveiled Tuesday."}, {"label": "COMEDY", "text": "Hearing is believing."}, {"label": "POLITICS", "text": "If the effort makes it through the chamber, tougher battles await."}, {"label": "POLITICS", "text": "A bipartisan committee will look at successors for the state attorney general, who has resigned in disgrace. Its recommendations might not mean much, though."}, {"label": "POLITICS", "text": "Trump's pick for CIA director oversaw a black site in Thailand where at least one detainee was reportedly tortured."}, {"label": "POLITICS", "text": "This will be the first state mandate of its kind."}, {"label": "WOMEN", "text": "A special prosecutor will look into claims that the former attorney general physically abused at least four women."}, {"label": "POLITICS", "text": "\"There’s no horde of invading people using fraud to game the asylum system.\""}, {"label": "POLITICS", "text": "Just seven states directly invest in programs designed to address shootings in cities. But that movement may be growing."}, {"label": "QUEER VOICES", "text": "Mayor Michael B. Hancock said his son's response during a traffic stop was \"inexcusable.\""}, {"label": "POLITICS", "text": "Progressives spent millions to challenge local prosecutors around the country who are maintaining the status quo."}, {"label": "POLITICS", "text": "The most innocent explanation of the payments to Michael Cohen's LLC is still pretty sketchy."}, {"label": "COMEDY", "text": "\"The Daily Show\" analyzed how President Donald Trump's tweets stacked up against his wife's goal of promoting safety online."}, {"label": "POLITICS", "text": "Trump's sabotage of Obamacare seems to be having predictable consequences."}, {"label": "POLITICS", "text": "The senator tells HuffPost it's time to ban right-to-work laws and make it easier to unionize."}, {"label": "ENTERTAINMENT", "text": "\"EPA\" takes on a whole new meaning."}, {"label": "POLITICS", "text": "A psychologist explains why men who advocate for women's rights can be abusive in their private lives."}, {"label": "RELIGION", "text": "Cub Scout and Boy Scout programs serve about 330,000 Mormon youth in the United States."}, {"label": "IMPACT", "text": "Meet the woman trying to save them."}, {"label": "POLITICS", "text": "Gina Haspel pledged not to revive the spy agency's interrogation operation — but she wouldn't condemn it."}, {"label": "MEDIA", "text": "CNN host says it doesn't look good for Trump's personal attorney."}, {"label": "BLACK VOICES", "text": "“It just brought back memories. From slavery,” a neighbor said."}, {"label": "POLITICS", "text": "Extremists \"R\" us."}, {"label": "POLITICS", "text": "Democrats are targeting the seat, and a former Marine is their candidate."}, {"label": "MEDIA", "text": "As media distrust grows, another outlet drops its liaison between the public and the newsroom."}, {"label": "POLITICS", "text": "Corporations were looking to get closer to the new administration, and Trump's lawyer offered to help."}, {"label": "POLITICS", "text": "McConnell's official campaign account trolls West Virginia GOP primary loser."}, {"label": "POLITICS", "text": "Republican Morrisey will face Sen. Joe Manchin, a conservative Democrat who has voted for the president's agenda 61 percent of the time."}, {"label": "POLITICS", "text": "The Ohio plan had overwhelming bipartisan support in the state legislature when lawmakers approved it for the May ballot."}, {"label": "POLITICS", "text": "It's a striking example of the president again making a move condemned by U.S. allies but likely to help Vladimir Putin."}, {"label": "QUEER VOICES", "text": "Nixon also quipped that Cuomo should come out of the closet and admit he's a Republican."}, {"label": "QUEER VOICES", "text": "The new policy aims to “recognize and respect” the province’s trans and non-binary community."}, {"label": "WOMEN", "text": "The director argued that people are embracing Me Too \"chiefly out of fear.\""}, {"label": "BLACK VOICES", "text": "\"Our goal is to normalize blackness.\""}, {"label": "BLACK VOICES", "text": "The actor spoke to HuffPost about being a sexual assault survivor and deprogramming toxic masculinity."}, {"label": "BLACK VOICES", "text": "\"Every now and again, a racial incident or an expression of art makes us pause and reflect, but we soon return to dancing.\""}, {"label": "MEDIA", "text": "\"Mr. President, please be wary of all of this,\" Andrew Napolitano said."}, {"label": "BLACK VOICES", "text": "“Change has come because people of color will be at the table,\" said Bishop-elect Patricia A. Davenport."}, {"label": "ENTERTAINMENT", "text": "The surgeon cited irreconcilable differences with the \"Thelma & Louise\" star."}, {"label": "ENTERTAINMENT", "text": "Goodbye, goth genius."}, {"label": "ENTERTAINMENT", "text": "\"You can't fire me on my day off!\" the actor cried on Twitter."}, {"label": "ENTERTAINMENT", "text": "The actress stepped out on the red carpet looking a bit ... orange."}, {"label": "WORLD NEWS", "text": "Last week, a majority of lawmakers rejected his candidacy."}, {"label": "WORLD NEWS", "text": "President Trump is set to meet with Kim sometime in the next few weeks."}, {"label": "WORLD NEWS", "text": "Last month's \"Iran lied\" presentation went over better than the \"Bibi Bomb.\""}, {"label": "WORLD NEWS", "text": "The unconventional serving dish was criticized as offensive and in poor taste."}, {"label": "WORLD NEWS", "text": "France, the U.K. and Germany had attempted a last-ditch push to get Trump to change his mind in recent weeks."}, {"label": "POLITICS", "text": "“I just don’t see a scenario where that’s a positive projection\" of the GOP brand, Sen. Thom Tillis (R-N.C.) said."}, {"label": "POLITICS", "text": "“It’s not about Eric Schneiderman. It is about a much larger movement to ensure accountability, and that is beyond the power of Eric Schneiderman to impugn.”"}, {"label": "POLITICS", "text": "U.S. allies France, Germany and Britain have all made overtures to persuade Trump to stay in the pact."}, {"label": "POLITICS", "text": "In a New Yorker article, four women accused Schneiderman of physical abuse, including slapping and choking them."}, {"label": "POLITICS", "text": "\"It doesn't usually turn out well,\" the MSNBC host said of feces flinging."}, {"label": "ENTERTAINMENT", "text": "It's the first for the \"Spider-Man\" star and fiance Jesse Plemons."}, {"label": "ENTERTAINMENT", "text": "2 Chainz proposed to his lady love Kesha Ward. Again!"}, {"label": "BLACK VOICES", "text": "The trio were met with police in the parking lot when they left the store after making a purchase."}, {"label": "POLITICS", "text": "The newest member of Trump’s legal team in the Russia probe says he feels bad for Cohen and Paul Manafort because of the “storm trooper tactics” used against them."}, {"label": "QUEER VOICES", "text": "“This is like my skin. I’m proud to be in it,” she said of her rainbow cape."}, {"label": "ENTERTAINMENT", "text": "And when they did, the women said he demanded they call him \"Daddy.\""}, {"label": "POLITICS", "text": "France, the U.K. and Germany have been working with the Trump administration in recent weeks in an attempt to change the president's mind."}, {"label": "POLITICS", "text": "Immigrants are less willing to report crimes or go to court because they fear they’ll be deported, according to a survey."}, {"label": "POLITICS", "text": "The effort stemmed from Meyers' 2011 roasting of Trump at the White House Correspondents' Dinner."}, {"label": "ENTERTAINMENT", "text": "Celebs did not disappoint with this year's \"Catholic imagination\" theme -- and neither did Twitter."}, {"label": "POLITICS", "text": "The GOP bill would lower income limits for some SNAP recipients and raise them for certain agricultural subsidies."}, {"label": "POLITICS", "text": "A guide to the 2015 international agreement that Donald Trump has plunged into crisis."}, {"label": "SPORTS", "text": "It was like a \"mini-lotto,\" says the Pick 5 winner."}, {"label": "POLITICS", "text": "North Carolina, West Virginia, Indiana and Ohio all have high-profile primary fights."}, {"label": "BLACK VOICES", "text": "Cynthia Erivo went to Nicki Minaj's manicurist and the results are divine."}, {"label": "ENTERTAINMENT", "text": "Most excellent news."}, {"label": "BLACK VOICES", "text": "The artist's outfit was a reminder that black bodies are indeed heavenly."}, {"label": "POLITICS", "text": "“He’s coming to talk, at some point or another, whether he wants to or not,\" said Rep. Trey Gowdy (R-S.C.)."}, {"label": "COMEDY", "text": "He even brought out a chalkboard for help."}, {"label": "RELIGION", "text": "Some celebrities' nods to the religious theme were obvious. Others needed a closer look."}, {"label": "BLACK VOICES", "text": "A police sergeant on the scene denied even knowing what Airbnb was."}, {"label": "COMEDY", "text": "The first lady's new initiative seems to be missing something."}, {"label": "COMEDY", "text": "\"The Daily Show\" host was  baffled by Giuliani's many explanations for revealing the president's actions in the Stormy Daniels case."}, {"label": "ENTERTAINMENT", "text": "It's about damn time."}, {"label": "POLITICS", "text": "The Republican version of fiscal conservatism is to increase the deficit by hundreds of billions and then propose $15 billion in cuts."}, {"label": "POLITICS", "text": "The president's son-in-law has been a \"driving force\" of the legislation, which focuses on the re-entry of federal prisoners. Many say it doesn't go far enough."}, {"label": "CRIME", "text": "Zimmerman appeared to threaten to feed the investigator to an alligator."}, {"label": "POLITICS", "text": "Thousands of newly released EPA documents show the agency went to great lengths to shield the embattled administrator from encounters with the public."}, {"label": "POLITICS", "text": "Liz Watson’s victory in southern Indiana will test the appeal of liberal populism in November."}, {"label": "POLITICS", "text": "Greg Pence, a former Marine with no previous political experience, has campaigned on much the same agenda as his younger brother."}, {"label": "POLITICS", "text": "A 19-year-old Marine has been linked to violent assaults in the deadly Charlottesville rally."}, {"label": "POLITICS", "text": "The move puts the future of the 2015 international agreement in crisis."}, {"label": "SPORTS", "text": "Over 45 women have accused Jean and Steven Lopez of sexual misconduct."}, {"label": "ENTERTAINMENT", "text": "It's all in the details."}, {"label": "MEDIA", "text": "\"I will tell them exactly what I think of their behavior.\""}, {"label": "RELIGION", "text": "Rev. James Martin, a Jesuit priest and author, took the comments in stride."}, {"label": "COMEDY", "text": "We so want a pooch like that."}, {"label": "BUSINESS", "text": "The bank pledged in April to stop financing companies that sell military-style firearms to civilians. Remington made the Bushmaster rifle used in the Sandy Hook school massacre."}, {"label": "QUEER VOICES", "text": "The new play depicts Tennessee Williams and William Inge as sexually charged (and non-white) rivals."}, {"label": "POLITICS", "text": "The man liberals loved was a myth."}, {"label": "MEDIA", "text": "She's the latest woman to replace a man disgraced by sexual misconduct allegations."}, {"label": "ENTERTAINMENT", "text": "Just like a prayer, indeed."}, {"label": "ENTERTAINMENT", "text": "The Hulk did not want to partake."}, {"label": "POLITICS", "text": "Robert Mueller has reportedly interviewed the Russian oligarch about the payments to Trump's lawyer."}, {"label": "COMEDY", "text": "\"Late Show\" offers up a lesson in fact vs. opinion."}, {"label": "ENTERTAINMENT", "text": "Now they don't have bad blood?"}, {"label": "ENTERTAINMENT", "text": "The \"Girls Trip\" star sat down with Will Smith's ex-wife for a candid conversation."}, {"label": "ENTERTAINMENT", "text": "He probably wasn't supposed to say that."}, {"label": "ENTERTAINMENT", "text": "The musician made sure — multiple times — that his date’s gorgeous dress looked flawless on the red carpet.  💕"}, {"label": "POLITICS", "text": "“I felt like I shouldn’t have said what I said,” the senator said."}, {"label": "COMEDY", "text": "Call it a memory refresher."}, {"label": "CRIME", "text": "\"We could finally have answers to one of the greatest whodunits of all time,\" a criminologist said."}, {"label": "ENTERTAINMENT", "text": "\"RIVERDALE\" PROM."}, {"label": "ENTERTAINMENT", "text": "The Starz adaptation of Stephanie Danler's novel immerses us in the sexual, racial and personal politics of the kitchen."}, {"label": "POLITICS", "text": "He is going around Democratic Sen. Tammy Baldwin to put Michael Brennan into a lifetime court seat in her state."}, {"label": "POLITICS", "text": "The secretary’s push to reshape the Interior Department won’t cut the number of agencies that oversee fish-laden streams."}, {"label": "POLITICS", "text": "In one instance, the politician reportedly threatened a partner, “if you ever left me, I’d kill you.”"}, {"label": "POLITICS", "text": "Federal immigration officials say that in sanctuary cities, they have little choice but to carry out enforcement activities in neighborhoods and other community locations, even though it is not an efficient use of their time or resources."}, {"label": "MEDIA", "text": "\"‘Pulling out’ is a bit of a misnomer,\" the Fox News host said."}, {"label": "WEIRD NEWS", "text": "Orange you intrigued?"}, {"label": "TRAVEL", "text": "Sometimes we can’t help but wonder if Mother Nature specifically designed some places just for Instagram."}, {"label": "WORLD NEWS", "text": "A motive for the attack has not been released."}, {"label": "WORLD NEWS", "text": "More than 70 percent of voters backed him in an election in which he had no serious challengers."}, {"label": "WORLD NEWS", "text": "Unofficial results showed Hezbollah and its political allies won just over half the seats in Lebanon’s parliamentary election."}, {"label": "MEDIA", "text": "The decision marks a major shift from its campaign against unionization at the Los Angeles Times last year."}, {"label": "POLITICS", "text": "Tuesday’s primaries are the first major chance for GOP voters to shape the party in the Trump era."}, {"label": "POLITICS", "text": "“We have the most qualified person, a woman, who Democrats want Out because she is too tough on terror,” Trump tweeted Monday."}, {"label": "ENTERTAINMENT", "text": "The 29-year-old has been participating in the competition for years."}, {"label": "POLITICS", "text": "Susan Collins and Rand Paul are seen as key votes in the heated debate over torture."}, {"label": "POLITICS", "text": "“As soon as we receive them, it is our intention to share them with the public,\" Rep. Adam Schiff (D-Calif.) said."}, {"label": "ENTERTAINMENT", "text": "\"We're human too y'all.\""}, {"label": "POLITICS", "text": "It's a dramatic shift from 2016."}, {"label": "ENTERTAINMENT", "text": "This low-budget horror flick could be for you."}, {"label": "POLITICS", "text": "The Utah senator said he hopes McCain changes his mind."}, {"label": "POLITICS", "text": "This is the \"most sexist administration in modern history,\" scoffs New York Times' Michelle Goldberg."}, {"label": "POLITICS", "text": "Trump’s newest lawyer has been spouting about North Korea and Iran."}, {"label": "POLITICS", "text": "Though her work and public appearances have been limited, she may be making the most of her \"impossible situation.\""}, {"label": "ENTERTAINMENT", "text": "\"The best night of my life,\" she said."}, {"label": "MEDIA", "text": "The nominee for CIA director will appear before the Senate Intelligence Committee for her confirmation hearing on Wednesday."}, {"label": "POLITICS", "text": "The retired lieutenant colonel was tried over his role in the secret sale of arms to Iran in the 1980s."}, {"label": "POLITICS", "text": "At least 16 states debated bills to regulate the short-term rental industry this year. Only one, Indiana’s, was signed into law."}, {"label": "ENTERTAINMENT", "text": "\"SNL\" alum Piscopo blasted the sketch featuring the porn star on Fox Business: \"What do I tell my kids?\""}, {"label": "COMEDY", "text": "Ewww!"}, {"label": "POLITICS", "text": "The New Yorker has vetted four women's accounts."}, {"label": "IMPACT", "text": "Tech is created by humans, and it’s vulnerable to our biases and stereotypes."}, {"label": "POLITICS", "text": "Cries for more gun restrictions have surged in the three months since the Parkland, Florida, shooting left 17 dead. You wouldn’t know it at the NRA’s annual convention."}, {"label": "POLITICS", "text": "“Senator McCain is everything that President Trump is not,” S.E. Cupp said to Tapper."}, {"label": "CRIME", "text": "It’s the first time an annual death toll in active shooting incidents exceeded 90 since the FBI began tracking the crimes in 2000."}, {"label": "ENTERTAINMENT", "text": "The singer is gearing up for her massive stadium tour."}, {"label": "TECH", "text": "The first-of-its-kind accident killed a pedestrian in Arizona earlier this year."}, {"label": "POLITICS", "text": "The \"Sex and the City\" star teased that a two-candidate debate in the Democratic race for New York governor would ensure there's \"nowhere to hide.”"}, {"label": "MEDIA", "text": "\"You just want that to go viral,\" Conway shot back."}, {"label": "COMEDY", "text": "Jeong, who also happens to be a doctor, initially thought the woman was a heckler."}, {"label": "BLACK VOICES", "text": "She's serving a life sentence for the murder of a man who allegedly picked her up for sex at age 16."}, {"label": "ENTERTAINMENT", "text": "This is what happens when you mangle the Bangles."}, {"label": "BLACK VOICES", "text": "From Jim Crow to Gwara Gwara, there are a lot of references you might've missed."}, {"label": "ENTERTAINMENT", "text": "Actor Louis Herthum fan-droids out over some of the show's biggest secrets."}, {"label": "ENTERTAINMENT", "text": "New biography offers a glimpse into the comedian’s struggle with dementia."}, {"label": "ENTERTAINMENT", "text": "The star apparently has a PhD in pleasure, and he wants you to know about it."}, {"label": "POLITICS", "text": "Attorneys are already fighting back."}, {"label": "ENTERTAINMENT", "text": "“Guardians of the Galaxy” director James Gunn interpreted it for a fan on Twitter."}, {"label": "COMEDY", "text": "\"Weekend Update\" anchor shuts down Kanye's incendiary comments."}, {"label": "COMEDY", "text": "\"Thanks very much everyone, but we are f**king done here.\""}, {"label": "POLITICS", "text": "The former coal CEO is one of the three leading contenders in Tuesday's GOP Senate primary in West Virginia."}, {"label": "POLITICS", "text": "Connecticut would join 10 other states and the District of Columbia in the National Popular Vote Interstate Compact."}, {"label": "POLITICS", "text": "Patrick Little responded by calling participants in the GOP convention “zionist stooges.”"}, {"label": "POLITICS", "text": "Her new booklet on kids' online activity looks lots like one the Federal Trade Commission released in 2014."}, {"label": "QUEER VOICES", "text": "\"I’m a human being who has a right to love who I love,\" the rapper's mother said at the 2018 GLAAD Media Awards."}, {"label": "QUEER VOICES", "text": "\"I’m not going to bow down. I am who I am. Accept me or not,” new mayor Bruno \"Ralphy\" Lozano said."}, {"label": "POLITICS", "text": "The former sheriff would also be the state’s first openly queer governor. But her victory is far from a given."}, {"label": "POLITICS", "text": "The Arizona senator says he ignored his gut on that one."}, {"label": "WEIRD NEWS", "text": "The on-duty clerk was pissed."}, {"label": "WOMEN", "text": "Paige Patterson has come under scrutiny for past comments advising women to stay in abusive relationships."}, {"label": "WOMEN", "text": "“It’s way, way more than anything I’ve ever seen,\" the iconic feminist said."}, {"label": "WORLD NEWS", "text": "The country has accused Washington of \"misleading public opinion.\""}, {"label": "WORLD NEWS", "text": "The country's young people and Jewish groups say low wages and a culture of hate is pushing people abroad."}, {"label": "WORLD NEWS", "text": "A methane gas build-up inside the mine is said to have caused the blast."}, {"label": "WORLD NEWS", "text": "For many younger Lebanese, Sunday brought a first chance to vote in a national election after parliament twice extended a term that expired in 2013."}, {"label": "POLITICS", "text": "The action could pave way for millions of Facebook users to go after the Trump-linked firm."}, {"label": "BLACK VOICES", "text": "DeEbony Groves' brother and mother got a standing ovation at Belmont University's graduation ceremony."}, {"label": "POLITICS", "text": "Republicans currently benefit from gerrymandering in Ohio, but are supporting a ballot measure that could make the redistricting process more fair."}, {"label": "COMEDY", "text": "Donald Glover and pals face the monster."}, {"label": "POLITICS", "text": "Our photographer took in the divided scene at the gun group's annual meeting in Dallas."}, {"label": "POLITICS", "text": "The French are also furious about Trump's \"obscene\" acting out of Paris terror attack."}, {"label": "CRIME", "text": "Rex Whitmire Harbour, 26, wrote that Nikolas Cruz was a \"hero,\" officials said."}, {"label": "POLITICS", "text": "He also maintains that the $130,000 Stormy Daniels payment didn't violate any laws."}, {"label": "POLITICS", "text": "Trump's team is straining to explain his comments last month that he didn't know about the payment to the porn star."}, {"label": "POLITICS", "text": "Haspel's role in the CIA’s use of brutal interrogation measures has generated bipartisan criticism."}, {"label": "POLITICS", "text": "Adam Putnam runs a traditional campaign. Ron DeSantis goes on Fox a lot to defend Trump. Guess which one Trump backs."}, {"label": "POLITICS", "text": "The White House has been asked to send Vice President Mike Pence instead."}, {"label": "COMEDY", "text": "Deny climate change all you want."}, {"label": "MEDIA", "text": "\"He's done considerable harm to the president,\" Stormy Daniels' lawyer said."}, {"label": "WOMEN", "text": "\"It is not finding the one right person that we think can save us from ourselves. It’s us.\""}, {"label": "POLITICS", "text": "They built lives in the U.S. with the government’s OK, and now they face an uncertain future."}, {"label": "POLITICS", "text": "\"I have no knowledge of that, but I would think if it was necessary, yes,\" Giuliani said."}, {"label": "COMEDY", "text": "Deflection, emotional conflict, breakthrough and a \"Lambo.\""}, {"label": "BLACK VOICES", "text": "The University of Florida's president has apologized for what he called \"inappropriately aggressive\" behavior."}, {"label": "ENTERTAINMENT", "text": "The video was released on YouTube shortly before the show."}, {"label": "IMPACT", "text": "\"We're not struggling.\""}, {"label": "POLITICS", "text": "Reformers love what Massachusetts is doing. The NRA? Not so much."}, {"label": "POLITICS", "text": "“How do you separate fact and opinion?” Giuliani wondered aloud."}, {"label": "WORLD NEWS", "text": "Anti-Kremlin activists took to the streets across the country on Saturday."}, {"label": "POLITICS", "text": "Bush was admitted to Houston Methodist Hospital on April 22, a day after he attended the funeral of his wife, Barbara."}, {"label": "ENTERTAINMENT", "text": "There are some additions to the streaming service worth watching."}, {"label": "ENTERTAINMENT", "text": "Here are the shows and movies joining Amazon."}, {"label": "ENTERTAINMENT", "text": "They're not people. But it's fun to imagine they are."}, {"label": "ENTERTAINMENT", "text": "“I saw Prince Charles just kind of looking perplexed.\""}, {"label": "POLITICS", "text": "But it probably doesn't hurt."}, {"label": "CRIME", "text": "\"He was only enjoying a glass of beer with his friend,\" the victim's wife said."}, {"label": "ENTERTAINMENT", "text": "It's part of the late-night host's \"Clueless Gamer\" series."}, {"label": "ENTERTAINMENT", "text": "Awww."}, {"label": "POLITICS", "text": "So much for gun control after Parkland."}, {"label": "COMEDY", "text": "The bogus FLOTUS also told \"Late Show\" host Stephen Colbert how the figure could soon come in handy."}, {"label": "POLITICS", "text": "It's Joaquin Oliver."}, {"label": "POLITICS", "text": "Now he says that while the president reimbursed Michael Cohen for the payment, he didn't know what it was for."}, {"label": "BLACK VOICES", "text": "\"I don’t regret saying it.\""}, {"label": "CRIME", "text": "Police said the man “likely saved” the 18-year-old suspect's life with his bold move."}, {"label": "POLITICS", "text": "It's \"not appropriate\" to say permits are \"required,\" warns the memo."}, {"label": "POLITICS", "text": "“If he’s in front of families he might say something in support of commonsense gun reform but then when he’s at the NRA, he’ll say something to get a big cheer.”"}, {"label": "POLITICS", "text": "The next front in the battle over affordable housing isn't Boston or San Francisco. It's Boise."}, {"label": "MEDIA", "text": "“No, you shut up!\""}, {"label": "IMPACT", "text": "A hashtag is mobilizing hundreds to vote in the Malaysian elections, but the bots are out in force too."}, {"label": "COMEDY", "text": "\"What is the point of going into this room every day?\""}, {"label": "BLACK VOICES", "text": "“Nobody deserves to die the way that they died,” said a relative of 21-year-old Alize Ramon Smith."}, {"label": "POLITICS", "text": "Breitbart led the charge, but Democrats delivered the killing blow. Has anyone really learned?"}, {"label": "WOMEN", "text": "Beth Moore started an important conversation about sexism in the church, and dozens of women are chiming in to support her."}, {"label": "POLITICS", "text": "\"He would absolutely look to try to use that to his advantage,” one police chief said."}, {"label": "POLITICS", "text": "Friday it's off to the NRA convention. Then golf!"}, {"label": "POLITICS", "text": "Agents are \"devoted to the rule of law,\" the former FBI director said."}, {"label": "POLITICS", "text": "“We’re really trying to find people who aren’t beholden to leadership,” Paul said."}, {"label": "POLITICS", "text": "As the GOP gathered at Trump’s golf resort, they focused on the positives and didn’t talk about that other stuff."}, {"label": "COMEDY", "text": "“Guess whose kid is going to be named Optimus Prime?\""}, {"label": "TECH", "text": "An “internal defect” led users’ account passwords to be stored in an internal log, the company said."}, {"label": "POLITICS", "text": "Officials in Seoul have denied the New York Times report."}, {"label": "ENTERTAINMENT", "text": "There's also big news for his upcoming 25th on-air anniversary."}, {"label": "QUEER VOICES", "text": "Krysta Montoya figured out a clever way to prove people wrong with a little help from Shonda Rhimes."}, {"label": "ENTERTAINMENT", "text": "\"Kanye has a lot of love for all of you.\""}, {"label": "POLITICS", "text": "Just like its subject, a new film on Supreme Court Justice Ruth Bader Ginsburg quietly and methodically plots the story of her career."}, {"label": "ENTERTAINMENT", "text": "So pure."}, {"label": "POLITICS", "text": "He wants any Trump interview with Mueller to be limited in time and scope."}, {"label": "COMEDY", "text": "\"You know Hannity can’t believe he accidentally made news on his show.\""}, {"label": "QUEER VOICES", "text": "Haynes posted a cryptic music video that seemed to hint at a breakup."}, {"label": "POLITICS", "text": "NBC and ABC walked back reports that federal investigators had wiretapped Trump’s longtime lawyer."}, {"label": "ENTERTAINMENT", "text": "Didn't see that coming."}, {"label": "POLITICS", "text": "Republicans are running far fewer ads mentioning Obamacare than they have in the past."}, {"label": "POLITICS", "text": "The president threw red meat to firearm enthusiasts while ignoring a more complicated reality."}, {"label": "POLITICS", "text": "\"Unless you happen to be Muslim.\""}, {"label": "COMEDY", "text": "Today's \"Stormy Watch\" finds Hurricane Rudy \"making landfall on Fox News.\""}, {"label": "SPORTS", "text": "This year's competitors include Free Drop Billy, Good Magic and Instilled Regard."}, {"label": "ENTERTAINMENT", "text": "May the Fourth be with you!"}, {"label": "POLITICS", "text": "Planned Parenthood and the ACLU plan to challenge the \"fetal heartbeat\" bill, which would effectively ban abortions at six weeks of pregnancy."}, {"label": "POLITICS", "text": "“Kanye West must have some power ... Thank you, Kanye, thank you,\" he said."}, {"label": "WEIRD NEWS", "text": "Brilliant, they are."}, {"label": "ENTERTAINMENT", "text": "The actress and good friend of the future duchess couldn't help but react to the question about a “say yes to the dress” moment."}, {"label": "QUEER VOICES", "text": "Many believe the president's new “faith initiative” will only \"divide and discriminate.\""}, {"label": "POLITICS", "text": "The president contradicted his lead attorney in remarks Friday."}, {"label": "POLITICS", "text": "\"I refuse to believe this is real.\""}, {"label": "WEIRD NEWS", "text": "The 25 most profound “Shower Thoughts” on Reddit from the last week."}, {"label": "COMEDY", "text": "Lay those bets down, people."}, {"label": "WEIRD NEWS", "text": "No matter if your mom is into \"Star Wars,\" wine or something even wilder, we've got you covered."}, {"label": "WEIRD NEWS", "text": "\"Was this taken inside a Ritz-Carlton?\""}, {"label": "POLITICS", "text": "Maryland just became the seventh state to enact a “Beagle Freedom” law, which seeks to find homes for cats and dogs that survive testing in research labs."}]