[{"entities": [{"end": 371, "start": 360, "tag": "Medicine"}, {"end": 408, "start": 383, "tag": "Medicine"}, {"end": 112, "start": 104, "tag": "MedicalCondition"}, {"end": 689, "start": 679, "tag": "Medicine"}, {"end": 23, "start": 6, "tag": "Medicine"}, {"end": 37, "start": 25, "tag": "Medicine"}, {"end": 470, "start": 461, "tag": "MedicalCondition"}, {"end": 589, "start": 577, "tag": "Medicine"}, {"end": 865, "start": 853, "tag": "MedicalCondition"}, {"end": 198, "start": 188, "tag": "Medicine"}, {"end": 762, "start": 754, "tag": "MedicalCondition"}, {"end": 880, "start": 870, "tag": "MedicalCondition"}, {"end": 833, "start": 823, "tag": "Medicine"}, {"end": 853, "start": 852, "tag": "MedicalCondition"}, {"end": 469, "start": 461, "tag": "MedicalCondition"}, {"end": 543, "start": 535, "tag": "MedicalCondition"}, {"end": 704, "start": 692, "tag": "Medicine"}, {"end": 571, "start": 563, "tag": "MedicalCondition"}], "text": "While bismuth compounds (Pepto-Bismol) decreased the number of bowel movements in those with travelers' diarrhea, they do not decrease the length of illness.[91] Anti-motility agents like loperamide are also effective at reducing the number of stools but not the duration of disease.[8] These agents should be used only if bloody diarrhea is not present.[92]\n\nDiosmectite, a natural aluminomagnesium silicate clay, is effective in alleviating symptoms of acute diarrhea in children,[93] and also has some effects in chronic functional diarrhea, radiation-induced diarrhea, and chemotherapy-induced diarrhea.[45] Another absorbent agent used for the treatment of mild diarrhea is kaopectate.\n\nRacecadotril an antisecretory medication may be used to treat diarrhea in children and adults.[86] It has better tolerability than loperamide, as it causes less constipation and flatulence.[94]"}, {"entities": [{"end": 382, "start": 364, "tag": "MedicalCondition"}, {"end": 8, "start": 0, "tag": "MedicalCondition"}, {"end": 116, "start": 94, "tag": "MedicalCondition"}, {"end": 189, "start": 178, "tag": "MedicalCondition"}, {"end": 232, "start": 221, "tag": "MedicalCondition"}, {"end": 32, "start": 23, "tag": "MedicalCondition"}, {"end": 435, "start": 409, "tag": "MedicalCondition"}, {"end": 401, "start": 386, "tag": "MedicalCondition"}], "text": "Diarrhea, also spelled diarrhoea, is the condition of having at least three loose, liquid, or watery bowel movements each day.[2] It often lasts for a few days and can result in dehydration due to fluid loss.[2] Signs of dehydration often begin with loss of the normal stretchiness of the skin and irritable behaviour.[2] This can progress to decreased urination, loss of skin color, a fast heart rate, and a decrease in responsiveness as it becomes more severe.[2] Loose but non-watery stools in babies who are exclusively breastfed, however, are normal.[2]"}, {"entities": [{"end": 22, "start": 0, "tag": "Medicine"}, {"end": 27, "start": 24, "tag": "Medicine"}, {"end": 123, "start": 120, "tag": "Medicine"}, {"end": 214, "start": 211, "tag": "Pathogen"}, {"end": 55, "start": 52, "tag": "Pathogen"}, {"end": 237, "start": 234, "tag": "Medicine"}, {"end": 151, "start": 148, "tag": "Pathogen"}], "text": "Antiretroviral therapy (ART) is recommended for all HIV-infected individuals to reduce the risk of disease progression.\nART also is recommended for HIV-infected individuals for the prevention of transmission of HIV.\nPatients starting ART should be willing and able to commit to treatment and understand the benefits and risks of therapy and the importance of adherence. Patients may choose to postpone therapy, and providers, on a case-by-case basis, may elect to defer therapy on the basis of clinical and/or psychosocial factors."}, {"entities": [{"end": 1589, "start": 1211, "tag": "MedicalCondition"}, {"end": 44, "start": 38, "tag": "Medicine"}, {"end": 374, "start": 356, "tag": "Medicine"}, {"end": 950, "start": 939, "tag": "Medicine"}, {"end": 1639, "start": 1638, "tag": "MedicalCondition"}, {"end": 1588, "start": 1212, "tag": "MedicalCondition"}, {"end": 269, "start": 262, "tag": "MedicalCondition"}, {"end": 78, "start": 60, "tag": "Medicine"}, {"end": 731, "start": 718, "tag": "Medicine"}, {"end": 248, "start": 227, "tag": "Medicine"}, {"end": 690, "start": 678, "tag": "Medicine"}, {"end": 206, "start": 197, "tag": "Medicine"}, {"end": 1385, "start": 1372, "tag": "Medicine"}, {"end": 867, "start": 856, "tag": "Medicine"}, {"end": 169, "start": 159, "tag": "Medicine"}, {"end": 142, "start": 130, "tag": "Medicine"}, {"end": 268, "start": 262, "tag": "Medicine"}, {"end": 574, "start": 561, "tag": "Medicine"}, {"end": 128, "start": 108, "tag": "Medicine"}, {"end": 1680, "start": 1670, "tag": "MedicalCondition"}, {"end": 106, "start": 80, "tag": "Medicine"}, {"end": 1616, "start": 1610, "tag": "MedicalCondition"}, {"end": 465, "start": 453, "tag": "Medicine"}, {"end": 817, "start": 797, "tag": "MedicalCondition"}, {"end": 606, "start": 595, "tag": "Medicine"}, {"end": 58, "start": 46, "tag": "Medicine"}, {"end": 844, "start": 823, "tag": "Medicine"}, {"end": 1136, "start": 1124, "tag": "Medicine"}, {"end": 1644, "start": 1630, "tag": "MedicalCondition"}, {"end": 590, "start": 579, "tag": "Medicine"}, {"end": 1370, "start": 1358, "tag": "Medicine"}, {"end": 1626, "start": 1618, "tag": "Medicine"}, {"end": 516, "start": 504, "tag": "Medicine"}, {"end": 154, "start": 144, "tag": "Medicine"}, {"end": 1408, "start": 1390, "tag": "Medicine"}, {"end": 106, "start": 81, "tag": "MedicalCondition"}, {"end": 222, "start": 211, "tag": "Medicine"}, {"end": 291, "start": 280, "tag": "Medicine"}], "text": "The following drugs are considered as DMARDs: methotrexate, hydroxychloroquine, sulfasalazine, leflunomide, TNF-alpha inhibitors (certolizumab, infliximab and etanercept), abatacept, and anakinra. Rituximab and tocilizumab are monoclonal antibodies and are also DMARDs.[8] Use of tocilizumab is associated with a risk of increased cholesterol levels.[87]\n\nHydroxychloroquine, apart from its low toxicity profile, is considered effective in the moderate RA treatment.[88]\n\nThe most commonly used agent is methotrexate with other frequently used agents including sulfasalazine and leflunomide.[8] Leflunomide is effective when used from 6–12 months, with similar effectiveness to methotrexate when used for 2 years.[89] Sulfasalazine also appears to be most effective in the short-term treatment of rheumatoid arthritis.[90] Sodium aurothiomalate (gold) and cyclosporin are less commonly used due to more common adverse effects.[8] However, cyclosporin was found to be effective in the progressive RA when used up to one year.[91] Agents may be used in combinations however, people may experience greater side effects.[8][92] Methotrexate is the most important and useful DMARD and is usually the first treatment.[8][5][93] A combined approach with methotrexate and biologics improves ACR50, HAQ scores and RA remission rates.[94] Triple therapy consisting of methotrexate, sulfasalazine and hydroxychloroquine may also effectively control disease activity.[95] Adverse effects should be monitored regularly with toxicity including gastrointestinal, hematologic, pulmonary, and hepatic.[93] Side effects such as nausea, vomiting or abdominal pain can be reduced by taking folic acid.[96]"}, {"entities": [{"end": 413, "start": 401, "tag": "Medicine"}, {"end": 396, "start": 378, "tag": "Medicine"}, {"end": 490, "start": 473, "tag": "Medicine"}, {"end": 263, "start": 255, "tag": "Medicine"}], "text": "The goals of treatment are to reduce pain, decrease inflammation, and improve a person's overall functioning.[5] This may be helped by balancing rest and exercise, the use of splints and braces, or the use of assistive devices.[1][6][7] Pain medications, steroids, and NSAIDs are frequently used to help with symptoms.[1] Disease-modifying antirheumatic drugs (DMARDs), such as hydroxychloroquine and methotrexate, may be used to try to slow the progression of disease.[1] Biological DMARDs may be used when disease does not respond to other treatments.[8] However, they may have a greater rate of adverse effects.[9] Surgery to repair, replace, or fuse joints may help in certain situations.[1] Most alternative medicine treatments are not supported by evidence.[10][11]"}, {"entities": [{"end": 12, "start": 0, "tag": "Pathogen"}, {"end": 406, "start": 394, "tag": "Pathogen"}, {"end": 239, "start": 227, "tag": "Pathogen"}, {"end": 110, "start": 95, "tag": "Pathogen"}], "text": "Hantaviruses, usually found in rodents and shrews, were discovered in two species of bats. The Mouyassué virus (MOUV) was isolated from banana pipistrelle bats captured near Mouyassué village in Cote d'Ivoire, West Africa. The Magboi virus was isolated from hairy slit-faced bats found near the Magboi River in Sierra Leone in 2011. They are single-stranded, negative sense, RNA viruses in the Bunyaviridae family.[29][30][31][32]"}, {"entities": [{"end": 41, "start": 35, "tag": "MedicalCondition"}, {"end": 168, "start": 162, "tag": "MedicalCondition"}, {"end": 167, "start": 165, "tag": "MedicalCondition"}, {"end": 396, "start": 384, "tag": "Pathogen"}, {"end": 1281, "start": 1269, "tag": "Pathogen"}, {"end": 1347, "start": 1343, "tag": "MedicalCondition"}, {"end": 983, "start": 977, "tag": "MedicalCondition"}, {"end": 1032, "start": 1027, "tag": "MedicalCondition"}], "text": "Bats are the most common source of rabies in humans in North and South America, Western Europe, and Australia. In the United States, there were 19 cases of human rabies from 1997–2006, 17 of which were attributed to bats.[27] In North America, about half of human rabies instances are cryptic, meaning that the patient has no known bite history.[24] While it has been speculated that rabies virus could be transmitted through aerosols, studies of the rabies virus have concluded that this is only feasible in limited conditions. These conditions include a very large colony of bats in a hot and humid cave with poor ventilation. While two human deaths in 1956 and 1959 had been tentatively attributed to aerosolization of the rabies virus after entering a cave with bats, \"investigations of the 2 reported human cases revealed that both infections could be explained by means other than aerosol transmission\".[28] It is instead generally thought that most instances of cryptic rabies are the result of an unknown bat bite.[24] Bites from a bat can be so small that they are not visible without magnification equipment, for example. Outside of bites, rabies virus exposure can also occur if infected fluids come in contact with a mucous membrane or a break in the skin. Rabies virus has also been transmitted when an infected human unknowingly dies of rabies, and their organs are transplanted to others.[28]"}, {"entities": [{"end": 68, "start": 35, "tag": "MedicalCondition"}, {"end": 252, "start": 240, "tag": "MedicalCondition"}, {"end": 74, "start": 70, "tag": "MedicalCondition"}, {"end": 457, "start": 453, "tag": "MedicalCondition"}, {"end": 251, "start": 240, "tag": "Pathogen"}, {"end": 376, "start": 360, "tag": "Pathogen"}, {"end": 323, "start": 319, "tag": "MedicalCondition"}, {"end": 386, "start": 378, "tag": "Pathogen"}], "text": "In 2003, following the outbreak of severe acute respiratory syndrome (SARS) which had begun the prior year in Asia, and secondary cases elsewhere in the world, the World Health Organization (WHO) issued a press release stating that a novel coronavirus identified by a number of laboratories was the causative agent for SARS. The virus was officially named the SARS coronavirus (SARS-CoV). More than 8,000 people were infected, about ten percent of whom died.[25]"}, {"entities": [{"end": 282, "start": 271, "tag": "MedicalCondition"}, {"end": 19, "start": 0, "tag": "Pathogen"}, {"end": 1319, "start": 1305, "tag": "MedicalCondition"}, {"end": 42, "start": 33, "tag": "Pathogen"}, {"end": 905, "start": 897, "tag": "MedicalCondition"}, {"end": 1807, "start": 1799, "tag": "MedicalCondition"}, {"end": 1559, "start": 1549, "tag": "MedicalCondition"}, {"end": 679, "start": 658, "tag": "MedicalCondition"}, {"end": 244, "start": 226, "tag": "MedicalCondition"}, {"end": 1432, "start": 1422, "tag": "Pathogen"}, {"end": 1388, "start": 1367, "tag": "Pathogen"}, {"end": 946, "start": 921, "tag": "Pathogen"}, {"end": 1879, "start": 1864, "tag": "MedicalCondition"}, {"end": 1416, "start": 1394, "tag": "Pathogen"}, {"end": 300, "start": 286, "tag": "MedicalCondition"}, {"end": 379, "start": 357, "tag": "Pathogen"}, {"end": 486, "start": 467, "tag": "Pathogen"}, {"end": 269, "start": 254, "tag": "MedicalCondition"}, {"end": 1635, "start": 1623, "tag": "MedicalCondition"}, {"end": 919, "start": 910, "tag": "MedicalCondition"}, {"end": 1827, "start": 1809, "tag": "MedicalCondition"}, {"end": 1907, "start": 1881, "tag": "Medicine"}, {"end": 1585, "start": 1573, "tag": "MedicalCondition"}, {"end": 1855, "start": 1843, "tag": "MedicalCondition"}, {"end": 41, "start": 33, "tag": "Pathogen"}, {"end": 1951, "start": 1921, "tag": "Medicine"}, {"end": 1693, "start": 1683, "tag": "MedicalCondition"}, {"end": 1636, "start": 1623, "tag": "MedicalCondition"}, {"end": 144, "start": 132, "tag": "Pathogen"}, {"end": 351, "start": 331, "tag": "Pathogen"}, {"end": 1226, "start": 1215, "tag": "Pathogen"}, {"end": 306, "start": 285, "tag": "Pathogen"}, {"end": 752, "start": 736, "tag": "Pathogen"}], "text": "Bacterial vaginosis is caused by bacteria that change the vaginal microbiota caused by an overgrowth of bacteria that crowd out the Lactobacilli species that maintain healthy vaginal microbial populations.\nOther non-bacterial vaginal infections include: yeast infection (candidiasis), Trichomonas vaginalis (trichomoniasis).[8][9]\nBacterial meningitis is a bacterial inflammation of the meninges, that is, the protective membranes covering the brain and spinal cord.\nBacterial pneumonia is a bacterial infection of the lungs.\nUrinary tract infection is predominantly caused by bacteria. Symptoms include the strong and frequent sensation or urge to urinate, pain during urination, and urine that is cloudy.[10] The main causal agent is Escherichia coli. Urine is typically sterile but contains a variety of salts, and waste products.[11] Bacteria can ascend into the bladder or kidney and causing cystitis and nephritis.\nBacterial gastroenteritis is caused by enteric, pathogenic bacteria. These pathogenic species are usually distinct from the usually harmless bacteria of the normal gut flora. But a different strain of the same species may be pathogenic. The distinction is sometimes difficult as in the case of Escherichia.\nBacterial skin infections include:\nImpetigo is a highly contagious bacterial skin infection commonly seen in children.[12] It is caused by Staphylococcus aureus, and Streptococcus pyogenes.[13]\nErysipelas is an acute streptococcus bacterial infection[14] of the deeper skin layers that spreads via with lymphatic system.\nCellulitis is a diffuse inflammation[15] of connective tissue with severe inflammation of dermal and subcutaneous layers of the skin. Cellulitis can be caused by normal skin flora or by contagious contact, and usually occurs through open skin, cuts, blisters, cracks in the skin, insect bites, animal bites, burns, surgical wounds, intravenous drug injection, or sites of intravenous catheter insertion. In most cases it is the skin on the face or lower legs that is affected, though cellulitis can occur in other tissues."}, {"entities": [{"end": 124, "start": 116, "tag": "Pathogen"}, {"end": 170, "start": 155, "tag": "Pathogen"}, {"end": 137, "start": 126, "tag": "Pathogen"}, {"end": 79, "start": 70, "tag": "Pathogen"}, {"end": 149, "start": 139, "tag": "Pathogen"}, {"end": 114, "start": 106, "tag": "Pathogen"}, {"end": 104, "start": 91, "tag": "Pathogen"}, {"end": 89, "start": 81, "tag": "Pathogen"}, {"end": 68, "start": 58, "tag": "Pathogen"}], "text": "Other groups of intracellular bacterial pathogens include Salmonella, Neisseria, Brucella, Mycobacterium, Nocardia, Listeria, Francisella, Legionella, and Yersinia pestis. These can exist intracellularly, but can exist outside of host cells."}, {"entities": [{"end": 340, "start": 327, "tag": "Pathogen"}, {"end": 521, "start": 514, "tag": "MedicalCondition"}, {"end": 522, "start": 513, "tag": "MedicalCondition"}, {"end": 447, "start": 433, "tag": "Pathogen"}, {"end": 462, "start": 452, "tag": "Pathogen"}, {"end": 285, "start": 276, "tag": "MedicalCondition"}, {"end": 536, "start": 523, "tag": "MedicalCondition"}, {"end": 571, "start": 564, "tag": "MedicalCondition"}, {"end": 446, "start": 433, "tag": "Pathogen"}, {"end": 548, "start": 538, "tag": "MedicalCondition"}, {"end": 356, "start": 345, "tag": "Pathogen"}, {"end": 77, "start": 65, "tag": "MedicalCondition"}, {"end": 558, "start": 550, "tag": "MedicalCondition"}, {"end": 536, "start": 524, "tag": "MedicalCondition"}, {"end": 115, "start": 89, "tag": "Pathogen"}, {"end": 431, "start": 423, "tag": "Pathogen"}], "text": "One of the bacterial diseases with the highest disease burden is tuberculosis, caused by Mycobacterium tuberculosis bacteria, which kills about 2 million people a year, mostly in sub-Saharan Africa. Pathogenic bacteria contribute to other globally important diseases, such as pneumonia, which can be caused by bacteria such as Streptococcus and Pseudomonas, and foodborne illnesses, which can be caused by bacteria such as Shigella, Campylobacter, and Salmonella. Pathogenic bacteria also cause infections such as tetanus, typhoid fever, diphtheria, syphilis, and leprosy. Pathogenic bacteria are also the cause of high infant mortality rates in developing countries.[3]"}, {"entities": [{"end": 667, "start": 659, "tag": "MedicalCondition"}, {"end": 449, "start": 436, "tag": "Pathogen"}, {"end": 689, "start": 673, "tag": "MedicalCondition"}, {"end": 38, "start": 30, "tag": "Pathogen"}, {"end": 465, "start": 454, "tag": "Pathogen"}, {"end": 657, "start": 647, "tag": "MedicalCondition"}, {"end": 106, "start": 87, "tag": "Pathogen"}, {"end": 554, "start": 542, "tag": "MedicalCondition"}, {"end": 540, "start": 532, "tag": "Pathogen"}, {"end": 39, "start": 30, "tag": "Pathogen"}, {"end": 571, "start": 561, "tag": "Pathogen"}, {"end": 630, "start": 623, "tag": "MedicalCondition"}, {"end": 490, "start": 471, "tag": "MedicalCondition"}, {"end": 645, "start": 632, "tag": "MedicalCondition"}, {"end": 555, "start": 542, "tag": "Pathogen"}, {"end": 667, "start": 648, "tag": "MedicalCondition"}], "text": "Although the vast majority of bacteria are harmless or beneficial to one's body, a few pathogenic bacteria can cause infectious diseases. The most common bacterial disease is tuberculosis, caused by the bacterium Mycobacterium tuberculosis, which affects about 2 million people mostly in sub-Saharan Africa. Pathogenic bacteria contribute to other globally important diseases, such as pneumonia, which can be caused by bacteria such as Streptococcus and Pseudomonas, and foodborne illnesses, which can be caused by bacteria such as Shigella, Campylobacter, and Salmonella. Pathogenic bacteria also cause infections such as tetanus, typhoid fever, diphtheria, syphilis, and Hansen's disease. They typically range between 1 and 5 micrometers in length."}, {"entities": [{"end": 390, "start": 379, "tag": "Medicine"}, {"end": 167, "start": 152, "tag": "Medicine"}, {"end": 422, "start": 411, "tag": "Medicine"}, {"end": 405, "start": 392, "tag": "Medicine"}, {"end": 196, "start": 176, "tag": "Medicine"}], "text": "Much like viral pathogens, infection by certain bacterial pathogens can be prevented via vaccines.[30] Vaccines against bacterial pathogens include the anthrax vaccine and the pneumococcal vaccine. Many other bacterial pathogens lack vaccines as a preventive measure, but infection by these bacteria can often be treated or prevented with antibiotics. Common antibiotics include amoxicillin, ciprofloxacin, and doxycycline. Each antibiotic has different bacteria that it is effective against and has different mechanisms to kill that bacteria. For example, doxycycline inhibits the synthesis of new proteins in both gram-negative and gram-positive bacteria which leads to the death of the affected bacteria.[35]"}, {"entities": [{"end": 167, "start": 158, "tag": "Pathogen"}, {"end": 119, "start": 95, "tag": "Pathogen"}, {"end": 193, "start": 187, "tag": "Pathogen"}, {"end": 156, "start": 147, "tag": "Pathogen"}, {"end": 145, "start": 140, "tag": "Pathogen"}], "text": "The term pathogen came into use in the 1880s.[1][2] Typically, the term is used to describe an infectious microorganism or agent, such as a virus, bacterium, protozoan, prion, viroid, or fungus.["}, {"entities": [{"end": 395, "start": 384, "tag": "Medicine"}, {"end": 1112, "start": 1098, "tag": "MedicalCondition"}, {"end": 1697, "start": 1687, "tag": "Medicine"}, {"end": 72, "start": 49, "tag": "MedicalCondition"}, {"end": 1178, "start": 1173, "tag": "Medicine"}, {"end": 1713, "start": 1702, "tag": "Medicine"}, {"end": 792, "start": 781, "tag": "Medicine"}, {"end": 1573, "start": 1563, "tag": "Medicine"}, {"end": 72, "start": 48, "tag": "MedicalCondition"}, {"end": 613, "start": 603, "tag": "Medicine"}, {"end": 1685, "start": 1675, "tag": "MedicalCondition"}, {"end": 1629, "start": 1613, "tag": "MedicalCondition"}, {"end": 379, "start": 369, "tag": "Medicine"}, {"end": 1301, "start": 1291, "tag": "Medicine"}, {"end": 1558, "start": 1546, "tag": "Medicine"}, {"end": 1402, "start": 1394, "tag": "MedicalCondition"}, {"end": 848, "start": 835, "tag": "MedicalCondition"}, {"end": 1112, "start": 1106, "tag": "MedicalCondition"}, {"end": 1392, "start": 1391, "tag": "MedicalCondition"}, {"end": 467, "start": 455, "tag": "Medicine"}, {"end": 1402, "start": 1391, "tag": "Medicine"}, {"end": 597, "start": 584, "tag": "MedicalCondition"}], "text": "Some antidepressants are used as a treatment for social anxiety disorder, but their efficacy is not entirely convincing, as only a small proportion of antidepressants showed some efficacy for this condition. Paroxetine was the first drug to be FDA-approved for this disorder. Its efficacy is considered beneficial, although not everyone responds favorably to the drug. Sertraline and fluvoxamine extended release were later approved for it as well, while escitalopram is used off-label with acceptable efficacy. However, there isn't enough evidence to support citalopram for treating social phobia, and fluoxetine was no better than placebo in clinical trials. SSRIs are used as a first-line treatment for social anxiety, but they don't work for everyone. One alternative would be venlafaxine, which is a SNRI. It showed benefits for social phobia in five clinical trials against placebo, while the other SNRIs are not considered particularly useful for this disorder as many of them didn't undergo testing for it. As of now, it is unclear if duloxetine and desvenlafaxine can provide benefits for social anxiety sufferers. However, another class of antidepressants called MAOIs are considered effective for social anxiety, but they come with many unwanted side effects and are rarely used. Phenelzine was shown to be a good treatment option, but its use is limited by dietary restrictions. Moclobemide is a RIMA and showed mixed results but still got approval in some European countries for social anxiety disorder. TCA antidepressants, such as clomipramine and imipramine, are not considered effective for this anxiety disorder in particular. This leaves out SSRIs such as paroxetine, sertraline and fluvoxamine CR as acceptable and tolerated treatment options for this disorder.[19][20]"}, {"entities": [{"end": 98, "start": 88, "tag": "Medicine"}, {"end": 346, "start": 335, "tag": "Medicine"}, {"end": 63, "start": 52, "tag": "Medicine"}], "text": "However, existing data suggest that patients taking bedaquiline in addition to standard TB therapy are five times more likely to die than those without the new drug,[184] which has resulted in medical journal articles raising health policy questions about why the FDA approved the drug and whether financial ties to the company making bedaquiline influenced physicians' support for its use.[183][185]"}, {"entities": [{"end": 129, "start": 118, "tag": "Medicine"}, {"end": 42, "start": 33, "tag": "Medicine"}, {"end": 54, "start": 46, "tag": "Medicine"}, {"end": 91, "start": 82, "tag": "Medicine"}, {"end": 43, "start": 33, "tag": "MedicalCondition"}, {"end": 114, "start": 104, "tag": "Medicine"}], "text": "Latent TB is treated with either isoniazid or rifampin alone, or a combination of isoniazid with either rifampicin or rifapentine.[90][91][92]\n\nThe treatment takes three to nine months depending on the medications used.[51][90][93][92] People with latent infections are treated to prevent them from progressing to active TB disease later in life.[94]"}, {"entities": [{"end": 541, "start": 523, "tag": "MedicalCondition"}, {"end": 148, "start": 138, "tag": "MedicalCondition"}, {"end": 170, "start": 155, "tag": "MedicalCondition"}, {"end": 313, "start": 299, "tag": "MedicalCondition"}, {"end": 462, "start": 446, "tag": "MedicalCondition"}], "text": "If a tuberculosis infection does become active, it most commonly involves the lungs (in about 90% of cases).[14][17] Symptoms may include chest pain and a prolonged cough producing sputum. About 25% of people may not have any symptoms (i.e. they remain \"asymptomatic\").[14] Occasionally, people may cough up blood in small amounts, and in very rare cases, the infection may erode into the pulmonary artery or a Rasmussen's aneurysm, resulting in massive bleeding.[9][18] Tuberculosis may become a chronic illness and cause extensive scarring in the upper lobes of the lungs. The upper lung lobes are more frequently affected by tuberculosis than the lower ones.[9] The reason for this difference is not clear.[13] It may be due to either better air flow,[13] or poor lymph drainage within the upper lungs.["}, {"entities": [], "text": "Tuberculosis may infect any part of the body, but most commonly occurs in the lungs (known as pulmonary tuberculosis).[9] Extrapulmonary TB occurs when tuberculosis develops outside of the lungs, although extrapulmonary TB may coexist with pulmonary TB.[9]\n\nGeneral signs and symptoms include fever, chills, night sweats, loss of appetite, weight loss, and fatigue.[9] Significant nail clubbing may also occur.[16]"}, {"entities": [{"end": 283, "start": 279, "tag": "Pathogen"}, {"end": 282, "start": 279, "tag": "Pathogen"}], "text": "A number of factors make people more susceptible to TB infections. The most important risk factor globally is HIV; 13% of all people with TB are infected by the virus.[39] This is a particular problem in sub-Saharan Africa, where rates of HIV are high.[40][41] Of people without HIV who are infected with tuberculosis, about 5–10% develop active disease during their lifetimes;[16] in contrast, 30% of those coinfected with HIV develop the active disease.[16]"}, {"entities": [{"end": 161, "start": 134, "tag": "MedicalCondition"}, {"end": 773, "start": 753, "tag": "MedicalCondition"}, {"end": 361, "start": 337, "tag": "MedicalCondition"}, {"end": 467, "start": 445, "tag": "MedicalCondition"}], "text": "In 15–20% of active cases, the infection spreads outside the lungs, causing other kinds of TB.[19] These are collectively denoted as \"extrapulmonary tuberculosis\".[20] Extrapulmonary TB occurs more commonly in people with a weakened immune system and young children. In those with HIV, this occurs in more than 50% of cases.[20] Notable extrapulmonary infection sites include the pleura (in tuberculous pleurisy), the central nervous system (in tuberculous meningitis), the lymphatic system (in scrofula of the neck), the genitourinary system (in urogenital tuberculosis), and the bones and joints (in Pott disease of the spine), among others. A potentially more serious, widespread form of TB is called \"disseminated tuberculosis\", it is also known as miliary tuberculosis.[9] Miliary TB currently makes up about 10% of extrapulmonary cases.[21]"}, {"entities": [{"end": 466, "start": 456, "tag": "MedicalCondition"}, {"end": 479, "start": 471, "tag": "MedicalCondition"}, {"end": 441, "start": 419, "tag": "Pathogen"}, {"end": 383, "start": 365, "tag": "Pathogen"}, {"end": 722, "start": 707, "tag": "Pathogen"}, {"end": 201, "start": 181, "tag": "Pathogen"}, {"end": 467, "start": 456, "tag": "MedicalCondition"}], "text": "Although viruses cause disruption of healthy homeostasis, resulting in disease, they may exist relatively harmlessly within an organism. An example would include the ability of the herpes simplex virus, which causes cold sores, to remain in a dormant state within the human body. This is called latency[153] and is a characteristic of the herpes viruses, including Epstein–Barr virus, which causes glandular fever, and varicella zoster virus, which causes chickenpox and shingles. Most people have been infected with at least one of these types of herpes virus.[154] These latent viruses might sometimes be beneficial, as the presence of the virus can increase immunity against bacterial pathogens, such as Yersinia pestis.[155]"}, {"entities": [{"end": 536, "start": 518, "tag": "MedicalCondition"}, {"end": 165, "start": 154, "tag": "Pathogen"}, {"end": 729, "start": 708, "tag": "MedicalCondition"}, {"end": 476, "start": 463, "tag": "Pathogen"}, {"end": 86, "start": 77, "tag": "MedicalCondition"}, {"end": 98, "start": 88, "tag": "MedicalCondition"}, {"end": 202, "start": 187, "tag": "MedicalCondition"}, {"end": 620, "start": 610, "tag": "Pathogen"}], "text": "Examples of common human diseases caused by viruses include the common cold, influenza, chickenpox, and cold sores. Many serious diseases such as rabies, Ebola virus disease, AIDS (HIV), avian influenza, and SARS are caused by viruses. The relative ability of viruses to cause disease is described in terms of virulence. Other diseases are under investigation to discover if they have a virus as the causative agent, such as the possible connection between human herpesvirus 6 (HHV6) and neurological diseases such as multiple sclerosis and chronic fatigue syndrome.[151] There is controversy over whether the bornavirus, previously thought to cause neurological diseases in horses, could be responsible for psychiatric illnesses in humans.[152]"}, {"entities": [{"end": 258, "start": 239, "tag": "MedicalCondition"}, {"end": 65, "start": 55, "tag": "Medicine"}, {"end": 534, "start": 531, "tag": "Pathogen"}, {"end": 427, "start": 416, "tag": "Medicine"}, {"end": 390, "start": 379, "tag": "Medicine"}, {"end": 364, "start": 352, "tag": "Medicine"}, {"end": 149, "start": 139, "tag": "Medicine"}], "text": "All medical applications known so far involve not pure adamantane, but its derivatives. The first adamantane derivative used as a drug was amantadine – first (1967) as an antiviral drug against various strains of flu[50] and then to treat Parkinson's disease.[51][52] Other drugs among adamantane derivatives include adapalene, adapromine, bromantane, carmantadine, chlodantane, dopamantine, memantine, rimantadine, saxagliptin, tromantadine, and vildagliptin. Polymers of adamantane have been patented as antiviral agents against HIV.[53]"}, {"entities": [{"end": 13, "start": 0, "tag": "Medicine"}, {"end": 109, "start": 88, "tag": "MedicalCondition"}, {"end": 14, "start": 0, "tag": "MedicalCondition"}], "text": "Buprenorphine has been shown experimentally (1982–1995) to be effective against severe, refractory depression"}, {"entities": [{"end": 229, "start": 203, "tag": "MedicalCondition"}, {"end": 279, "start": 258, "tag": "MedicalCondition"}, {"end": 201, "start": 181, "tag": "MedicalCondition"}, {"end": 73, "start": 51, "tag": "MedicalCondition"}, {"end": 10, "start": 0, "tag": "Medicine"}, {"end": 46, "start": 38, "tag": "MedicalCondition"}], "text": "Gabapentin, approved for treatment of seizures and postherpetic neuralgia in adults, has side-effects which are useful in treating bipolar disorder1, essential tremor, hot flashes, migraine prophylaxis, neuropathic pain syndromes, phantom limb syndrome, and restless leg syndrome.[11]"}, {"entities": [{"end": 279, "start": 274, "tag": "Medicine"}, {"end": 21, "start": 11, "tag": "Medicine"}, {"end": 312, "start": 302, "tag": "Medicine"}, {"end": 312, "start": 301, "tag": "MedicalCondition"}, {"end": 390, "start": 380, "tag": "Medicine"}, {"end": 175, "start": 170, "tag": "Medicine"}, {"end": 9, "start": 0, "tag": "Medicine"}], "text": "Bupropion (Wellbutrin), an anti-depressant, is also used as a smoking cessation aid; this indication was later approved, and the name of the smoking cessation product is Zyban. In Ontario, Canada, smoking cessation drugs are not covered by provincial drug plans; elsewhere, Zyban is priced higher than Wellbutrin, despite being the same drug. Therefore, some physicians prescribe Wellbutrin for both indications.["}, {"entities": [{"end": 288, "start": 267, "tag": "MedicalCondition"}, {"end": 261, "start": 248, "tag": "MedicalCondition"}, {"end": 13, "start": 0, "tag": "Medicine"}, {"end": 59, "start": 43, "tag": "MedicalCondition"}, {"end": 167, "start": 145, "tag": "MedicalCondition"}, {"end": 14, "start": 0, "tag": "MedicalCondition"}, {"end": 189, "start": 176, "tag": "MedicalCondition"}, {"end": 82, "start": 64, "tag": "MedicalCondition"}, {"end": 212, "start": 191, "tag": "MedicalCondition"}], "text": "Carbamazepine is an approved treatment for bipolar disorder and epileptic seizures, but it has side effects useful in treating attention-deficit hyperactivity disorder (ADHD), schizophrenia, phantom limb syndrome, paroxysmal extreme pain disorder, neuromyotonia, and post-traumatic stress disorder.[8]"}, {"entities": [{"end": 648, "start": 639, "tag": "MedicalCondition"}, {"end": 46, "start": 35, "tag": "Medicine"}, {"end": 725, "start": 712, "tag": "Medicine"}, {"end": 30, "start": 20, "tag": "Medicine"}], "text": "The antiviral drugs amantadine and rimantadine inhibit a viral ion channel (M2 protein), thus inhibiting replication of the influenza A virus.[86] These drugs are sometimes effective against influenza A if given early in the infection but are ineffective against influenza B viruses, which lack the M2 drug target.[160] Measured resistance to amantadine and rimantadine in American isolates of H3N2 has increased to 91% in 2005.[161] This high level of resistance may be due to the easy availability of amantadines as part of over-the-counter cold remedies in countries such as China and Russia,[162] and their use to prevent outbreaks of influenza in farmed poultry.[163][164] The CDC recommended against using M2 inhibitors during the 2005–06 influenza season due to high levels of drug resistance.[165]"}, {"entities": [{"end": 137, "start": 128, "tag": "Medicine"}, {"end": 58, "start": 48, "tag": "MedicalCondition"}, {"end": 110, "start": 101, "tag": "Medicine"}, {"end": 123, "start": 112, "tag": "Medicine"}, {"end": 124, "start": 112, "tag": "MedicalCondition"}, {"end": 57, "start": 48, "tag": "MedicalCondition"}, {"end": 99, "start": 88, "tag": "Medicine"}], "text": "The two classes of antiviral drugs used against influenza are neuraminidase inhibitors (oseltamivir, zanamivir, laninamivir and peramivir) and M2 protein inhibitors (adamantane derivatives)"}, {"entities": [{"end": 202, "start": 191, "tag": "MedicalCondition"}, {"end": 9, "start": 0, "tag": "MedicalCondition"}, {"end": 852, "start": 845, "tag": "MedicalCondition"}, {"end": 775, "start": 756, "tag": "Pathogen"}, {"end": 476, "start": 468, "tag": "MedicalCondition"}, {"end": 235, "start": 227, "tag": "MedicalCondition"}, {"end": 851, "start": 845, "tag": "MedicalCondition"}, {"end": 245, "start": 237, "tag": "MedicalCondition"}, {"end": 793, "start": 777, "tag": "MedicalCondition"}, {"end": 868, "start": 855, "tag": "MedicalCondition"}, {"end": 225, "start": 215, "tag": "MedicalCondition"}, {"end": 663, "start": 652, "tag": "MedicalCondition"}, {"end": 464, "start": 455, "tag": "MedicalCondition"}, {"end": 264, "start": 251, "tag": "MedicalCondition"}, {"end": 463, "start": 455, "tag": "MedicalCondition"}, {"end": 93, "start": 78, "tag": "Pathogen"}], "text": "Influenza, commonly known as \"the flu\", is an infectious disease caused by an influenza virus.[1] Symptoms can be mild to severe.[5] The most common symptoms include: high fever, runny nose, sore throat, muscle and joint pain, headache, coughing, and feeling tired.[1] These symptoms typically begin two days after exposure to the virus and most last less than a week.[1] The cough, however, may last for more than two weeks.[1] In children, there may be diarrhea and vomiting, but these are not common in adults.[6] Diarrhea and vomiting occur more commonly in gastroenteritis, which is an unrelated disease and sometimes inaccurately referred to as \"stomach flu\" or the \"24-hour flu\".[6] Complications of influenza may include viral pneumonia, secondary bacterial pneumonia, sinus infections, and worsening of previous health problems such as asthma or heart failure.[2][5]"}]